FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
#include "sensors_lib.h"
#include "driver/gpio.h"
#include "log_lib.h"

#include "esp_rom_sys.h"
#include "esp_timer.h"

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "driver/i2c_master.h"

#include "driver/spi_common.h"
#include "driver/spi_master.h"

#include "driver/pulse_cnt.h"

#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_continuous.h"
#include "soc/soc_caps.h"

#include "driver/rmt_rx.h"
#include "driver/rmt_tx.h"
#include "driver/gpio.h"
#include "esp_timer.h"

#if CONFIG_USE_UDPLIB
#include "udp_lib.h"
#endif

#if CONFIG_USE_ESPNOW
#include "espnow_lib.h"
#endif

#if CONFIG_USE_LEDLIB
#include "actuators_lib.h"
#include "cmd_lib.h"
#endif

static const char * TAG = "sensors_library";

static volatile bool monitoring = false;

#if CONFIG_USE_INA226 || CONFIG_USE_MPU9250 || CONFIG_USE_VL53L1X || CONFIG_USE_AS5600

#define SCL_GPIO 20
#define SDA_GPIO 19

//data transferred in MSB

i2c_master_bus_config_t master_cfg = {
    .clk_source = I2C_CLK_SRC_DEFAULT,
    .i2c_port = I2C_NUM_0,
    .scl_io_num = SCL_GPIO,
    .sda_io_num = SDA_GPIO,
    .glitch_ignore_cnt = 7,
    .flags.enable_internal_pullup = true,
};
i2c_master_bus_handle_t master_handle = NULL;
#endif

void serialize_header(header_sensor_t *hd, uint8_t *buf) {
    if (hd == NULL || buf == NULL) {
        return;
    }
    buf[0] = hd->type;
    buf[1] = hd->esp_id;
    memcpy(&buf[2], &hd->timestamp, sizeof(uint32_t)); //little-endian
}

static volatile bool front_blocked = false;
static volatile bool rear_blocked = false;

esp_err_t get_rear_blocked(bool* blocked) {
    #if CONFIG_USE_HCSR04
    *blocked = rear_blocked;
    return ESP_OK;
    #else
    return ESP_ERR_INVALID_STATE;
    #endif
}

esp_err_t get_front_blocked(bool* blocked) {
    #if CONFIG_USE_HCSR04
    *blocked = front_blocked;
    return ESP_OK;
    #else
    return ESP_ERR_INVALID_STATE;
    #endif
}

#if CONFIG_USE_HCSR04

#define PULSE_TRIG_DURATION 10 //10us
#define ECHO_TIMEOUT 60 //60ms
#define HC_PERIOD 50

typedef struct hc_cfg_st {
    uint8_t trig_pin;
    uint8_t echo_pin;
    uint8_t hc_id;
    SemaphoreHandle_t sem_hcsr;
    int64_t last_timestamp;
    int64_t echo_duration; 
} hc_cfg_t;

static hc_cfg_t hc_cfgs[2] = {
    {
        .trig_pin = 17,
        .echo_pin = 18,
        .hc_id = 0,
        .echo_duration = 0,
        .last_timestamp = -1,
    },
    {
        .trig_pin = 15,
        .echo_pin = 16,
        .hc_id = 1,
        .echo_duration = 0,
        .last_timestamp = -1,
    },
};

static void IRAM_ATTR echo_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;
    hc_cfg_t* hc_cfg = (hc_cfg_t *)arg;

    if (gpio_get_level(hc_cfg->echo_pin) == 1) {
        hc_cfg->last_timestamp = esp_timer_get_time();
    } else { //falling edge
        if (hc_cfg->last_timestamp > 0) {
            hc_cfg->echo_duration = esp_timer_get_time() - hc_cfg->last_timestamp;
            xSemaphoreGiveFromISR(hc_cfg->sem_hcsr, &taskAwoken);
            portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore (trig_echo)
        }
        hc_cfg->last_timestamp = -1;  // reset
    }
}

static void print_hc(int64_t val) {
    log_msg(TAG, "value received: %lld, to centimeters: %.1fcm",
            val, val / 58.0);
}

static esp_err_t init_hc_gpio(hc_cfg_t* hc_cfg) {
    esp_err_t err;

    //avoid re-initialization
    if (hc_cfg->sem_hcsr != NULL) {
        log_msg(TAG, "HC-SR04 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    hc_cfg->sem_hcsr = xSemaphoreCreateBinary();
    if (hc_cfg->sem_hcsr == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }
    
    err = gpio_reset_pin(hc_cfg->trig_pin);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), hc_cfg->trig_pin);
        return err;
    }
    err = gpio_reset_pin(hc_cfg->echo_pin);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), hc_cfg->echo_pin);
        return err;
    }

    err = gpio_set_direction(hc_cfg->trig_pin, GPIO_MODE_OUTPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), hc_cfg->trig_pin);
        return err;
    }
    err = gpio_set_direction(hc_cfg->echo_pin, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), hc_cfg->echo_pin);
        return err;
    }

    err = gpio_set_intr_type(hc_cfg->echo_pin, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), hc_cfg->echo_pin);
        return err;
    }

    return ESP_OK;
}

static esp_err_t init_hcsr() {
    esp_err_t err;

    for (int i = 0; i < sizeof(hc_cfgs) / sizeof(hc_cfg_t); i++) {
        err = init_hc_gpio(&hc_cfgs[i]);
        if (err != ESP_OK) return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr", esp_err_to_name(err));
        return err;
    }

    for (int i = 0; i < sizeof(hc_cfgs) / sizeof(hc_cfg_t); i++) {
        err = gpio_isr_handler_add(hc_cfgs[i].echo_pin, echo_isr_handler, &hc_cfgs[i]);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), hc_cfgs[i].echo_pin);
            return err;
        }
    }

    //or gpio_isr_register()
    log_msg(TAG, "HC-SR04 initialized");
    return ESP_OK;
    
}

static int64_t trigger_echo(hc_cfg_t* hc_cfg) {
    esp_err_t err;

    if (hc_cfg == NULL) return -1;
    if (hc_cfg->sem_hcsr == NULL) return -1;

    //log_msg(TAG, "Triggering echo..");

    err = gpio_set_level(hc_cfg->trig_pin, 1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), hc_cfg->trig_pin);
        return -1;
    }
    esp_rom_delay_us(PULSE_TRIG_DURATION);
    err = gpio_set_level(hc_cfg->trig_pin, 0);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), hc_cfg->trig_pin);
        return -1;
    }

    //log_msg(TAG, "Echo triggered");

