FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    if (xSemaphoreTake(hc_cfg->sem_hcsr, pdMS_TO_TICKS(ECHO_TIMEOUT)) == pdFALSE) {
        return -1; //after tiemout
    } else {
        return hc_cfg->echo_duration; //semaphore given from ISR
    }
}

#define HC_PAYLOAD_SIZE sizeof(int64_t)

static double last_distance_front = 0.0;
static double last_distance_rear = 0.0;



/**
 * 50 ms monitoring HC task
 */
static void hc_task(void * params) {
    esp_err_t err;

    if (params == NULL) {
        vTaskDelete(NULL);
        return;
    }
    hc_cfg_t* hc_cfg = (hc_cfg_t *)params;
    
    int64_t val_hc;

    while (monitoring)
    {
        val_hc = trigger_echo(hc_cfg); //blocking

        if (val_hc >= 0 && val_hc < 30000) {
    
            int16_t motor = 0;
            bool last_sign_positive = false;
            bool blocking = false;

            if (get_active_hc_blocking(&blocking) == ESP_OK && blocking) {
                if (get_motor_percent(&motor) == ESP_OK && get_last_motor_sign_positive(&last_sign_positive) == ESP_OK) {
                    if (hc_cfg->hc_id == 0) { // front hc — plus de "&& last_sign_positive" ici
                        // le déclenchement reste conditionné au sens
                        if (((val_hc / 58.0 - last_distance_front < -2.0 && val_hc / 58.0 < motor * 0.1 && last_sign_positive)
                            || val_hc / 58.0 < 10.0) && !front_blocked) {
                            force_motor_stop();
                            front_blocked = true;
                            log_msg_lvl(ESP_LOG_WARN, TAG, "Front HC blocked: val: %.2f", val_hc / 58.0);
                        }
                        // déblocage : indépendant du sens actuel, s'exécute toujours pour hc_id == 0
                        if (front_blocked && val_hc / 58.0 > 10.0) {
                            log_msg_lvl(ESP_LOG_WARN, TAG, "Front HC unblocked: val: %.2f", val_hc / 58.0);
                            front_blocked = false;
                        }
                        last_distance_front = val_hc / 58.0;
                    }
                    if (hc_cfg->hc_id == 1) { //rear hc // le déclenchement reste conditionné au sens
                        if (((val_hc / 58.0 - last_distance_rear < -2.0 && val_hc / 58.0 < -motor * 0.1 && !last_sign_positive)
                            || val_hc / 58.0 < 10.0) && !rear_blocked) {
                            force_motor_stop();
                            rear_blocked = true;
                            log_msg_lvl(ESP_LOG_WARN, TAG, "Rear HC blocked: val: %.2f", val_hc / 58.0);
                        }
                        // déblocage : indépendant du sens actuel, s'exécute toujours pour hc_id == 0
                        if (rear_blocked && val_hc / 58.0 > 10.0) {
                            log_msg_lvl(ESP_LOG_WARN, TAG, "Rear HC unblocked: val: %.2f", val_hc / 58.0);
                            rear_blocked = false;
                        }
                        last_distance_rear = val_hc / 58.0;
                    }
                }
            }

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_HCSR04;
            uint8_t buf[HEADER_SENSOR_SIZE + HC_PAYLOAD_SIZE + 2];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = hc_cfg->hc_id;
            memcpy(&buf[HEADER_SENSOR_SIZE + 1], &val_hc, sizeof(int64_t));
            buf[HEADER_SENSOR_SIZE + 1 + HC_PAYLOAD_SIZE] = (uint8_t)(hc_cfg->hc_id == 0 ? front_blocked : rear_blocked);
            //print_hc(val_hc);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }

        vTaskDelay(pdMS_TO_TICKS(HC_PERIOD));
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_INA226

#define INA_ADDR 0x40
#define INA_PERIOD 70

typedef struct ina_info_st {
    int16_t shunt;
    int16_t bus;
    uint16_t current;
    uint16_t power;
} ina_info_t;

//pointer towards i2c device
i2c_master_dev_handle_t ina_handle;

//describe ina i2c device
i2c_device_config_t ina_cfg = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7, //length of i2c address
    .device_address = INA_ADDR, //address of device
    .scl_speed_hz = 400000, //i2c bus frequency (400khz supported by ina)
};

static void print_ina(ina_info_t *ina) {
    log_msg(TAG, "Shunt received: %d, value: %.3fmV", ina->shunt, ina->shunt * 2.5e-6f * 1e3f);
    log_msg(TAG, "Bus received: %d, value: %.3fV", ina->bus, ina->bus * 1.25e-3f);
    log_msg(TAG, "Power received: %d, value: %.3fmW", ina->power, ina->power * 25e-6f * 25 * 1e3f);
    log_msg(TAG, "Current received: %d, value: %.3fmA", ina->current, ina->current * 25e-6f * 1e3f);
}

static esp_err_t init_ina() {

    esp_err_t err;

    //config of i2c registers, gpio, start
    if (master_handle == NULL) {
        err = i2c_new_master_bus(&master_cfg, &master_handle);
        if (err != ESP_OK) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) allocating I²C master bus", esp_err_to_name(err));
            return err;
        }
    }

    err = i2c_master_bus_add_device(master_handle, &ina_cfg, &ina_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) adding INA device to master bus", esp_err_to_name(err));
        return err;
    }

    //write config (ack each frame)
    //start master
    //frame 1 : slave adress byte
    //frame 2 : register pointer
    //frame 3 : data MSB
    //frame 4 : data LSB
    //stop master

    //data frame of 2 bytes
    //bit 15 : reset to default
    //9-11 : AVG
    //6-8 : Vbus CT
    //3-5 : Vsh CT
    //0-2 : Mode
    //default : 01000001 00100111
    uint16_t cfg_frame = 0;
    cfg_frame |= 1 << 15; //reset bit

    uint8_t buf_cfg[3] = {
        0x00,                    //config register
        (cfg_frame >> 8) & 0xFF, //MSB
        cfg_frame & 0xFF         //LSB
    };
    err = i2c_master_transmit(ina_handle, buf_cfg, 3, -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) transmitting INA config frame", esp_err_to_name(err));
        return err;
    }

    //wait 2ms for reset
    vTaskDelay(pdMS_TO_TICKS(2));

    //calibration: CAL = 0.00512 / (Current_LSB * Rshunt)
    // Current_LSB = MaxCurrent / 2^15
    // --> I = U/R = 0.08192 / 0.1
    // --> Current_LSB = 0.000025
    // --> CAL = 2048
    uint16_t cal_frame = 2048;

