FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    uint8_t buf_cal[3] = {
        0x05,                    //config register
        (cal_frame >> 8) & 0xFF, //MSB
        cal_frame & 0xFF         //LSB
    };
    err = i2c_master_transmit(ina_handle, buf_cal, 3, -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) transmitting INA calibration frame", esp_err_to_name(err));
        return err;
    }

    log_msg(TAG, "INA226 initialized");

    return ESP_OK;
    
}

static esp_err_t get_ina_info(ina_info_t *ina_info) {
    if (ina_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t err;

    //reading (ack each frame)
    //start master
    //frame 1 : slave adress byte
    //frame 3 : data MSB
    //frame 4 : data LSB
    //stop master

    //change register pointer, write new register to read
    uint8_t reg_ptr[1] = {0x01};
    uint8_t buf_rec[2];

    //shunt voltage
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) receiving shunt", esp_err_to_name(err));
        return err;
    }
    ina_info->shunt = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    //bus voltage
    reg_ptr[0] = 0x02;
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving bus", esp_err_to_name(err));
        return err;
    }
    ina_info->bus = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    //power
    reg_ptr[0] = 0x03;
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving power", esp_err_to_name(err));
        return err;
    }
    ina_info->power = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    //current
    reg_ptr[0] = 0x04;
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving current", esp_err_to_name(err));
        return err;
    }
    ina_info->current = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    return ESP_OK;
}

#define INA_PAYLOAD_SIZE (2 * sizeof(int16_t) + 2 * sizeof(uint16_t))

static void serialize_ina(ina_info_t *ina, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE;
    memcpy(&buf[len], &ina->bus, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len], &ina->current, sizeof(uint16_t));
    len += sizeof(uint16_t);
    memcpy(&buf[len], &ina->power, sizeof(uint16_t));
    len += sizeof(uint16_t);
    memcpy(&buf[len], &ina->shunt, sizeof(int16_t));
}

/**
 * Periodic INA monitoring task
 */
static void ina_task(void * params) {
    esp_err_t err;
    ina_info_t ina_info;

    err = init_ina();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        err = get_ina_info(&ina_info);

        if (err == ESP_OK) {
            
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_INA226;
            uint8_t buf[HEADER_SENSOR_SIZE + INA_PAYLOAD_SIZE];
            serialize_header(&header, buf);
            serialize_ina(&ina_info, buf);
            //print_ina(&ina_info);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }

        vTaskDelay(pdMS_TO_TICKS(INA_PERIOD));
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_KY035

#define KY_GPIO 34
#define KY_PERIOD 10

// Variables globales pour le driver
static adc_oneshot_unit_handle_t adc1_handle = NULL;
static adc_cali_handle_t adc1_cali_handle = NULL;

// Choisis ton canal (ADC1_CHANNEL_6 est sur le GPIO 34)
#define HALL_ADC_CHANNEL ADC1_CHANNEL_6

#define KY_PAYLOAD_SIZE (sizeof(uint64_t) + sizeof(int64_t))

static volatile ky_info_t ky_info = {0};

static void serialize_ky(ky_info_t *ky, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE;
    memcpy(&buf[len], &ky->signal_count, sizeof(uint64_t));
    len += sizeof(uint64_t);
    memcpy(&buf[len], &ky->signal_duration, sizeof(int64_t));
}

static void print_ky(ky_info_t *ky) {
    if (ky->signal_duration == 0) {
        log_msg(TAG, "[mean]; tr/s : 0.000, v: 0.000km/h (Stopped), count: %d",
            ky->signal_count);
        return;
    }

    // On utilise ky->signal_duration qui est déjà la moyenne des deltas de la fenêtre
    double duration_s = ky->signal_duration * 1e-6;
    double tr_per_s = 1.0 / duration_s;
    double v_ms = 3.14159 * 6.75e-2 * tr_per_s;
    double v_kmh = v_ms * 3.6;

    log_msg(TAG, "[mean]; tr/s : %.3f, v: %.3fm/s, v: %.3fkm/h, count: %d",
        tr_per_s, v_ms, v_kmh, ky->signal_count);
}

/**
 * Initialize KY
 */
esp_err_t init_ky() {

    esp_err_t err;

    ky_info.signal_count = 0;
    ky_info.signal_duration = 0;

    // 1. Init unité ADC1
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    err = adc_oneshot_new_unit(&init_config, &adc1_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_new_unit failed: %s", esp_err_to_name(err));
        return err;
    }

    // 2. Config canal (GPIO34 = ADC1_CHANNEL_6 sur ESP32)
    adc_oneshot_chan_cfg_t chan_config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = ADC_ATTEN_DB_12,   // 0~3.1V
    };
    err = adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_6, &chan_config);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_config_channel failed: %s", esp_err_to_name(err));
        return err;
    }

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_curve_fitting(&cali_config, &adc1_cali_handle);
#else
    // 3. Calibration (line fitting, ESP32 classique)
    adc_cali_line_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_line_fitting(&cali_config, &adc1_cali_handle);
#endif

    if (err != ESP_OK) {
        // Pas bloquant, on continue sans calibration
        log_msg_lvl(ESP_LOG_WARN, TAG, "Calibration non disponible: %s", esp_err_to_name(err));
        adc1_cali_handle = NULL;
    }

    log_msg(TAG, "KY-003 initialized");

    return ESP_OK;
}

/**
 * Get signal of KY-003.
 * This function should be polled.
 * @returns KY info structure, or NULL if error
 */
ky_info_t* get_signal_info() {

    static int64_t last_timestamp = 0;
    static uint8_t last_lvl = 1;

    int64_t now = esp_timer_get_time();

    uint8_t lvl = gpio_get_level(KY_GPIO);

