FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    if (lvl == 1 && last_lvl == 0) {
        ky_info.signal_count++;
        ky_info.signal_duration = now - last_timestamp;
        last_timestamp = now;
        log_msg(TAG, "[instant]; tr/s : %.3f, v: %.3fm/s, v: %.3fkm/h", 
            1.0 / (ky_info.signal_duration * 1e-6),
            3.14 * 6.75e-2 / (ky_info.signal_duration * 1e-6),
            3.6 * 3.14 * 6.75e-2 / (ky_info.signal_duration * 1e-6));
        return (ky_info_t*)&ky_info;
    }
    
    last_lvl = lvl;

    return NULL;
}

/**
 * Periodic KY monitoring task
 */
static void ky_task(void * params) {

    int raw_val;
    int64_t last_timestamp = 0;
    bool last_state = false;
    const TickType_t poll_delay = pdMS_TO_TICKS(10);

    while (monitoring) {
        esp_err_t err = adc_oneshot_read(adc1_handle, ADC_CHANNEL_6, &raw_val);
        if (err != ESP_OK) {
            vTaskDelay(poll_delay);
            continue;
        }

        bool current_state = (raw_val < 1800);
        //log_msg(TAG, "voltage: %dmV", raw_val);

        if (current_state && !last_state) {
            int64_t now = esp_timer_get_time();
            if (last_timestamp != 0) {
                ky_info_t snapshot = {
                    .signal_count    = ++ky_info.signal_count,
                    .signal_duration = now - last_timestamp,
                };
                ky_info.signal_duration = snapshot.signal_duration;
                
                header_sensor_t header = {0};
                header.esp_id = (uint8_t)CONFIG_ESP_ID;
                header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
                header.type = SENSOR_TYPE_KY035;
                uint8_t buf[HEADER_SENSOR_SIZE + KY_PAYLOAD_SIZE];
                serialize_header(&header, buf);
                serialize_ky(&snapshot, buf);
                
            #if CONFIG_USE_UDPLIB
                send_udp_sensor(buf, sizeof(buf));
            #endif
            #if CONFIG_USE_ESPNOW
            #endif

            }
            last_timestamp = now;
        }

        last_state = current_state;
        vTaskDelay(poll_delay);
    }
    vTaskDelete(NULL);
}

//signal of KY-003 is analogic, so edge interruptions don't work.
//even here, in the function we could have an invalid value of gpio level
//especially with fast polling
//this leads to an invalid count

//another way is by using ADC with one shot read
//and according to voltage, decide if the magnet should be considered or not
//this would correct the error of invalid count

//still same issue, and if period < 10ms, the ADC oneshot generates an error
//due to mutex timeout for adc

#endif

#if CONFIG_USE_BMP280
#define BMP_ADDR 0x76
#define BMP_PERIOD 50

//pointer towards i2c device
i2c_master_dev_handle_t bmp_handle;

//describe ina i2c device
i2c_device_config_t bmp_cfg = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7, //length of i2c address
    .device_address = BMP_ADDR, //address of device
    .scl_speed_hz = 400000, //i2c bus frequency
};
#define BMP_PAYLOAD_SIZE (2 * sizeof(int32_t))

typedef struct bmp_info_st {
    int32_t temperature;
    int32_t pressure;
} bmp_info_t;

//structure to store pressure calibration values from BMP
typedef struct bmp_dig_p_st {
    uint16_t dig_P1;
    int16_t  dig_P2;
    int16_t  dig_P3;
    int16_t  dig_P4;
    int16_t  dig_P5;
    int16_t  dig_P6;
    int16_t  dig_P7;
    int16_t  dig_P8;
    int16_t  dig_P9;
} bmp_dig_p_t;

//structure to store temperature calibration values from BMP
typedef struct bmp_dig_t_st {
    uint16_t dig_T1;
    int16_t  dig_T2;
    int16_t  dig_T3;
} bmp_dig_t_t;

static bmp_dig_p_t cal_dig_p;
static bmp_dig_t_t cal_dig_t;

//calibration value to determine pressure using temperature
static int32_t t_fine;

static void print_bmp(bmp_info_t *bmp) {
    log_msg(TAG, "Temperature BMP received: %d, value: %.2f°C", bmp->temperature,
        bmp->temperature / 100.0);
    log_msg(TAG, "Pressure received: %d, value: %.3fbar", bmp->pressure, bmp->pressure * 1e-5);
}

/**
 * Initialize BMP280 sensor i2c
 */
static esp_err_t init_bmp() {
    esp_err_t err;

    //config of i2c registers, gpio, start
    if (master_handle == NULL) {
        err = i2c_new_master_bus(&master_cfg, &master_handle);
        if (err != ESP_OK) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) allocating I²C master bus", esp_err_to_name(err));
            return err;
        }
    }

    err = i2c_master_bus_add_device(master_handle, &bmp_cfg, &bmp_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) adding bmp device to master bus", esp_err_to_name(err));
        return err;
    }

    //reboot bmp
    uint8_t reset_bmp_data[] = {0xE0, 0xB6};

    err = i2c_master_transmit(bmp_handle, reset_bmp_data, sizeof(reset_bmp_data), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) resetting bmp", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(10)); //wait for reboot

    //setup bmp
    uint8_t pwr_bmp_data[] = {0xF4, 0x00};
    //normal mode
    pwr_bmp_data[1] |= 1 << 0;
    pwr_bmp_data[1] |= 1 << 1;

    //measure p : ultra low power, 16bit/2.26Pa resolution
    pwr_bmp_data[1] |= 1 << 2;

    //measure T : ultra low power, 16bit/0.005°C resolution
    pwr_bmp_data[1] |= 1 << 5;

    //see in 3.4 - filter selection (doc) for example applications config

    err = i2c_master_transmit(bmp_handle, pwr_bmp_data, sizeof(pwr_bmp_data), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) waking up bmp", esp_err_to_name(err));
        return err;
    }

    //device identifier
    uint8_t reg_bmp = 0xD0;
    uint8_t who_bmp;
    err = i2c_master_transmit_receive(bmp_handle, &reg_bmp, 1, &who_bmp, 1, -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) getting who am i bmp", esp_err_to_name(err));
        return err;
    }
    log_msg(TAG, "WHO_AM_I bmp: 0x%02X", who_bmp);

    //calibration temperature
    uint8_t reg_dig_t = 0x88;
    uint8_t buf_dig_t[6];
    err = i2c_master_transmit_receive(bmp_handle, &reg_dig_t, 1, buf_dig_t, sizeof(buf_dig_t), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) receiving mpu info", esp_err_to_name(err));
        return err;
    }
    
    cal_dig_t.dig_T1 = buf_dig_t[0] | (buf_dig_t[1] << 8);
    cal_dig_t.dig_T2 = (int16_t)(buf_dig_t[2] | (buf_dig_t[3] << 8));
    cal_dig_t.dig_T3 = (int16_t)(buf_dig_t[4] | (buf_dig_t[5] << 8));

    //calibration pressure
    uint8_t reg_dig_p = 0x8E;
    uint8_t buf_dig_p[18];
    err = i2c_master_transmit_receive(bmp_handle, &reg_dig_p, 1, buf_dig_p, sizeof(buf_dig_p), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) reading pressure calib", esp_err_to_name(err));
        return err;
    }

