FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    cal_dig_p.dig_P1 =          buf_dig_p[0]  | ((uint16_t)buf_dig_p[1]  << 8);
    cal_dig_p.dig_P2 = (int16_t)(buf_dig_p[2]  | ((uint16_t)buf_dig_p[3]  << 8));
    cal_dig_p.dig_P3 = (int16_t)(buf_dig_p[4]  | ((uint16_t)buf_dig_p[5]  << 8));
    cal_dig_p.dig_P4 = (int16_t)(buf_dig_p[6]  | ((uint16_t)buf_dig_p[7]  << 8));
    cal_dig_p.dig_P5 = (int16_t)(buf_dig_p[8]  | ((uint16_t)buf_dig_p[9]  << 8));
    cal_dig_p.dig_P6 = (int16_t)(buf_dig_p[10] | ((uint16_t)buf_dig_p[11] << 8));
    cal_dig_p.dig_P7 = (int16_t)(buf_dig_p[12] | ((uint16_t)buf_dig_p[13] << 8));
    cal_dig_p.dig_P8 = (int16_t)(buf_dig_p[14] | ((uint16_t)buf_dig_p[15] << 8));
    cal_dig_p.dig_P9 = (int16_t)(buf_dig_p[16] | ((uint16_t)buf_dig_p[17] << 8));

    log_msg(TAG, "BMP280 initialized");

    return ESP_OK;
}


//convert function from bosch
static esp_err_t convert_temperature(int32_t *raw_temp) {

    int32_t v1, v2, T;
    v1 = (((*raw_temp >> 3) - ((int32_t)cal_dig_t.dig_T1 << 1)) * (int32_t)cal_dig_t.dig_T2) >> 11;
    v2 = (((((*raw_temp >> 4) - (int32_t)cal_dig_t.dig_T1) *
        ((*raw_temp >> 4) - (int32_t)cal_dig_t.dig_T1)) >> 12) * (int32_t)cal_dig_t.dig_T3) >> 14;
    t_fine = v1 + v2;
    T = (t_fine * 5 + 128) >> 8;

    *raw_temp = T;

    return ESP_OK;
}

/**
 * Convert raw BMP280 pressure ADC to Pa (int32 version, datasheet BST-BMP280-DS001)
 * MUST be called AFTER convert_temperature() — using t_fine
 * @param raw_pressure in/out 32 bit pressure
 */
static esp_err_t convert_pressure(int32_t *raw_pressure) {
    if (raw_pressure == NULL) return ESP_ERR_INVALID_ARG;

    int32_t  var1, var2;
    uint32_t p;
    
    var1 = ((int32_t)t_fine >> 1) - (int32_t)64000;
    var2 = (((var1 >> 2) * (var1 >> 2)) >> 11) * (int32_t)cal_dig_p.dig_P6;
    var2 = var2 + ((var1 * (int32_t)cal_dig_p.dig_P5) << 1);
    var2 = (var2 >> 2) + ((int32_t)cal_dig_p.dig_P4 << 16);
    var1 = (((int32_t)cal_dig_p.dig_P3 * (((var1 >> 2) * (var1 >> 2)) >> 13) >> 3)
            + (((int32_t)cal_dig_p.dig_P2 * var1) >> 1)) >> 18;
    var1 = ((32768 + var1) * (int32_t)cal_dig_p.dig_P1) >> 15;

    if (var1 == 0) {
        log_msg(TAG, "Pressure: division by zero, check P1 calibration");
        return ESP_ERR_INVALID_STATE;
    }

    p = (uint32_t)((int32_t)1048576 - *raw_pressure);
    p = (p - (uint32_t)(var2 >> 12)) * 3125;

    if (p < 0x80000000U) {
        p = (p << 1) / (uint32_t)var1;
    } else {
        p = (p / (uint32_t)var1) * 2;
    }

    var1 = ((int32_t)cal_dig_p.dig_P9 * (int32_t)(((p >> 3) * (p >> 3)) >> 13)) >> 12;
    var2 = ((int32_t)(p >> 2) * (int32_t)cal_dig_p.dig_P8) >> 13;
    p = (uint32_t)((int32_t)p + ((var1 + var2 + cal_dig_p.dig_P7) >> 4));

    *raw_pressure = (int32_t)p; 
    return ESP_OK;
}

/**
 * Getting bmp info
 * @returns ESP_OK success, others error 
 */
static esp_err_t get_bmp_info(bmp_info_t *bmp_info) {
    if (bmp_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t err;

    uint8_t reg_bmp = 0xF7;
    uint8_t buf_bmp[6];  // 6 bytes : temp(3) + pressure(3)
    err = i2c_master_transmit_receive(bmp_handle, &reg_bmp, 1, buf_bmp, sizeof(buf_bmp), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) receiving mpu info", esp_err_to_name(err));
        return err;
    }

        //xlsb : first four bytes [7:4]
    bmp_info->pressure = (buf_bmp[0] << 12) | (buf_bmp[1] << 4) | (buf_bmp[2] >> 4); //20 bits word
    bmp_info->temperature = (buf_bmp[3] << 12) | (buf_bmp[4] << 4) | (buf_bmp[5] >> 4);

    err = convert_temperature(&bmp_info->temperature);
    if (err != ESP_OK) return err;

    err = convert_pressure(&bmp_info->pressure);
    if (err != ESP_OK) return err;

    //other formulas on datasheet

    return ESP_OK;
}

static void serialize_bmp(bmp_info_t *bmp, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE;
    memcpy(&buf[len] ,&bmp->pressure, sizeof(int32_t));
    len += sizeof(int32_t);
    memcpy(&buf[len] ,&bmp->temperature, sizeof(int32_t));
}

/**
 * 50 ms monitoring BMP task
 */
static void bmp_task(void * params) {
    esp_err_t err;
    bmp_info_t bmp_info;

    err = init_bmp();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        err = get_bmp_info(&bmp_info);

        if (err == ESP_OK) {
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_BMP;
            uint8_t buf[HEADER_SENSOR_SIZE + BMP_PAYLOAD_SIZE];
            serialize_header(&header, buf);
            serialize_bmp(&bmp_info, buf);
            //print_bmp(&bmp_info);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }

        vTaskDelay(pdMS_TO_TICKS(BMP_PERIOD));
    }
    vTaskDelete(NULL);
}

#endif 

#if CONFIG_USE_MPU9250

#define AK8963_ADDR 0x0C

#define MPU_ADDR 0b1101000
#define MPU_PERIOD 50

//pointer towards i2c device
i2c_master_dev_handle_t mpu_handle;

//describe ina i2c device
i2c_device_config_t mpu_cfg = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7, //length of i2c address
    .device_address = MPU_ADDR, //address of device
    .scl_speed_hz = 400000, //i2c bus frequency
};

typedef struct mpu_info_st {
    int16_t accel_x;
    int16_t accel_y;
    int16_t accel_z;
    int16_t temp_mpu;
    int16_t gyro_x;
    int16_t gyro_y;
    int16_t gyro_z;
} mpu_info_t;


static void print_mpu(mpu_info_t *mpu) {
    log_msg(TAG, "Accel_X received: %d", mpu->accel_x);
    log_msg(TAG, "Accel_Y received: %d", mpu->accel_y);
    log_msg(TAG, "Accel_Z received: %d", mpu->accel_z);
    log_msg(TAG, "Gyro_X received: %d", mpu->gyro_x);
    log_msg(TAG, "Gyro_Y received: %d", mpu->gyro_y);
    log_msg(TAG, "Gyro_Z received: %d", mpu->gyro_z);
    log_msg(TAG, "Temperature MPU received: %d, value: %.3f°C",
        mpu->temp_mpu,(mpu->temp_mpu - 0.0)/333.87 + 21.0);
}

/**
 * Initialize MPU9250 sensor i2c
 */
static esp_err_t init_mpu() {
    esp_err_t err;

    //config of i2c registers, gpio, start
    if (master_handle == NULL) {
        err = i2c_new_master_bus(&master_cfg, &master_handle);
        if (err != ESP_OK) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) allocating I²C master bus", esp_err_to_name(err));
            return err;
        }
    }

    err = i2c_master_bus_add_device(master_handle, &mpu_cfg, &mpu_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) adding mpu device to master bus", esp_err_to_name(err));
        return err;
    }

    //reboot mpu
    uint8_t pwr_data[] = {0x6B, 0x00};

    pwr_data[1] |= 1 << 7; //reset

    err = i2c_master_transmit(mpu_handle, pwr_data, sizeof(pwr_data), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) waking up mpu", esp_err_to_name(err));
        return err;
    }

