FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    vTaskDelay(pdMS_TO_TICKS(100)); //wait for reboot

    uint8_t pwr_wakeup[] = {0x6B, 0x01}; 
    err = i2c_master_transmit(mpu_handle, pwr_wakeup, sizeof(pwr_wakeup), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) waking up mpu", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(10));

    //mpu device identifier
    uint8_t reg = 0x75;
    uint8_t who;
    err = i2c_master_transmit_receive(mpu_handle, &reg, 1, &who, 1, -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) getting who am i mpu", esp_err_to_name(err));
        return err;
    }
    log_msg(TAG, "WHO_AM_I mpu: 0x%02X", who);

    
    // CONFIG (0x1A) - DLPF_CFG=3 -> gyro filtré à 41Hz (bande passante), delay 5.9ms
    uint8_t config_data[] = {0x1A, 0x03};
    err = i2c_master_transmit(mpu_handle, config_data, sizeof(config_data), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) setting gyro DLPF", esp_err_to_name(err));
        return err;
    }

    // ACCEL_CONFIG_2 (0x1D) - A_DLPFCFG=3, accel_fchoice_b=0 -> accel filtré à 44.8Hz
    uint8_t accel_cfg2_data[] = {0x1D, 0x03};
    err = i2c_master_transmit(mpu_handle, accel_cfg2_data, sizeof(accel_cfg2_data), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) setting accel DLPF", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(100)); //wait for config setup

    log_msg(TAG, "MPU9250 initialized");

    return ESP_OK;
}

static int16_t accel_offset_x = 0, accel_offset_y = 0, accel_offset_z = 0;

/**
 * Getting MPU info
 * @returns ESP_OK success, others error 
 */
static esp_err_t get_mpu_info(mpu_info_t *mpu_info) {
    if (mpu_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t err;

    uint8_t reg = 0x3B;
    uint8_t buf[14];  // 14 bytes : accel(6) + temp(2) + gyro(6)
    err = i2c_master_transmit_receive(mpu_handle, &reg, 1, buf, sizeof(buf), -1);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) receiving mpu info", esp_err_to_name(err));
        return err;
    }

    mpu_info->accel_x = (int16_t)(((uint16_t)buf[0] << 8) | buf[1]) - accel_offset_x;
    mpu_info->accel_y = (int16_t)(((uint16_t)buf[2] << 8) | buf[3]) - accel_offset_y;
    mpu_info->accel_z = (int16_t)(((uint16_t)buf[4] << 8) | buf[5]) - accel_offset_z;
    mpu_info->temp_mpu    = ((uint16_t)buf[6]  << 8) | buf[7];
    mpu_info->gyro_x  = ((uint16_t)buf[8]  << 8) | buf[9];
    mpu_info->gyro_y  = ((uint16_t)buf[10] << 8) | buf[11];
    mpu_info->gyro_z  = ((uint16_t)buf[12] << 8) | buf[13];

    return ESP_OK;
}

static esp_err_t calibrate_accel_offset(void) {
    const int N = 200;
    int32_t sum_x = 0, sum_y = 0, sum_z = 0;
    mpu_info_t sample;

    log_msg(TAG, "Calibrating accel offset, keep car still...");
    for (int i = 0; i < N; i++) {
        esp_err_t err = get_mpu_info(&sample);
        if (err != ESP_OK) return err;
        sum_x += (int16_t)sample.accel_x;
        sum_y += (int16_t)sample.accel_y;
        sum_z += (int16_t)sample.accel_z;
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    accel_offset_x = sum_x / N;
    accel_offset_y = sum_y / N;
    accel_offset_z = sum_z / N;  // attention: sur Z, soustrais 1g (16384 LSB @ ±2g) avant de stocker si tu veux Z=0 au repos, pas Z=g
    log_msg(TAG, "Offsets: x=%d y=%d z=%d", accel_offset_x, accel_offset_y, accel_offset_z);
    return ESP_OK;
}

#define MPU_PAYLOAD_SIZE (7 * sizeof(int16_t))

static void serialize_mpu(mpu_info_t *mpu, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE;
    memcpy(&buf[len] ,&mpu->accel_x, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->accel_y, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->accel_z, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_x, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_y, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_z, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->temp_mpu, sizeof(int16_t));
    len += sizeof(int16_t);
}

/**
 * 50 ms monitoring MPU task
 */
static void mpu_task(void * params) {
    esp_err_t err;
    mpu_info_t mpu_info;

    err = init_mpu();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    err = calibrate_accel_offset();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        err = get_mpu_info(&mpu_info);

        if (err == ESP_OK) {
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_MPU9250;
            uint8_t buf[HEADER_SENSOR_SIZE + MPU_PAYLOAD_SIZE];
            serialize_header(&header, buf);
            serialize_mpu(&mpu_info, buf);
            //print_mpu(&mpu_info);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }

        vTaskDelay(pdMS_TO_TICKS(MPU_PERIOD));
    }
    vTaskDelete(NULL);
}
#endif

#if CONFIG_USE_RFID_RC522

#define PIN_NUM_MISO 19
#define PIN_NUM_MOSI 23
#define PIN_NUM_CLK  18
#define PIN_NUM_CS   21
#define PIN_NUM_RST  22

#define RC522_REG_VERSION  0x37
#define RC522_REG_TX_CONTROL 0x14

// Registres du RC522
#define RC522_REG_COMMAND      0x01
#define RC522_REG_COMM_EN      0x02
#define RC522_REG_COMM_IRQ     0x04
#define RC522_REG_ERROR        0x06
#define RC522_REG_FIFO_DATA    0x09
#define RC522_REG_FIFO_LEVEL   0x0A
#define RC522_REG_CONTROL      0x0C
#define RC522_REG_BIT_FRAMING  0x0D

// RC522 commands [18.3]
#define PCD_IDLE               0x00
#define PCD_TRANSCEIVE         0b00001100 // Transmetting then receiving

// Commandes des Cartes/Badges (PICC)
#define PICC_REQA              0x26 // Request Type A (cherche une carte)
#define PICC_ANTICOLL          0x93 // Anti-collision (demande l'UID)
#define PICC_HALT              0x50 // Met la carte en sommeil

#define RC522_REG_MODE          0x11  // Registre de définition du mode de transmission
#define RC522_REG_TX_ASK        0x15  // Registre de configuration de la modulation TX
#define RC522_REG_RF_CFG        0x26  // Registre du Gain de l'antenne

static void rc522_write_reg(spi_device_handle_t spi, uint8_t reg, uint8_t val) {
    uint8_t tx_data[2];
    
    // SPI Address [10.2.4] (MSB = 0 = write) (LSB = 0)
    // reading bit 1-6
    tx_data[0] = (reg << 1) & 0b01111110; 

