FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    // Sending value after [10.2.3]
    tx_data[1] = val;

    spi_transaction_t t = {
        .length = 16,           // in bits
        .tx_buffer = tx_data,
        .rx_buffer = NULL       //no return value expected
    };

    // Sends to bus, blocking function
    spi_device_polling_transmit(spi, &t);

    // if more than 16 bits, it may be better to go with ISR (aka without polling)
}

static uint8_t rc522_read_reg(spi_device_handle_t spi, uint8_t reg) {
    uint8_t tx_data[2];
    uint8_t rx_data[2];
    
    // SPI Address (MSB = 1 = read) (LSB = 0)
    tx_data[0] = ((reg << 1) & 0x7E) | 0x80; 
    tx_data[1] = 0x00; // dummy byte because the slave sends its response at the next 8 cycles

    spi_transaction_t t = {
        .length = 16,           // in bits
        .tx_buffer = tx_data,
        .rx_buffer = rx_data
    };

    // Send (MOSI) and receive (MISO)
    spi_device_polling_transmit(spi, &t);

    // it is possible to burst (= send 1 address, receive several data bytes)
    
    // first byte is garbage (when address is sent)
    return rx_data[1]; 
}

static esp_err_t rc522_to_card(spi_device_handle_t spi, uint8_t command, 
                               uint8_t *send_data, uint8_t send_len, 
                               uint8_t *back_data, uint32_t *back_len) {

    //Command to IDLE [9.2.1.2]
    rc522_write_reg(spi, RC522_REG_COMMAND, PCD_IDLE);

    //[9.2.1.5] : puts to 0 (bit7) others bits 6-0 (Interruption flags)
    rc522_write_reg(spi, RC522_REG_COMM_IRQ, 0b01111111);
    
    //[9.2.1.11] flush buffer (bit 7 = 1)
    rc522_write_reg(spi, RC522_REG_FIFO_LEVEL, 0x80); 

    // [9.2.1.10] I/O 64 bytes fifo buffer writing
    for (int i = 0; i < send_len; i++) {
        rc522_write_reg(spi, RC522_REG_FIFO_DATA, send_data[i]);
    }

    // executing command 
    rc522_write_reg(spi, RC522_REG_COMMAND, command);
    if (command == PCD_TRANSCEIVE) {
        // [9.2.1.14] bit7 = 1 = startsend, after reading bit 6-0 already configured
        rc522_write_reg(spi, RC522_REG_BIT_FRAMING, rc522_read_reg(spi, RC522_REG_BIT_FRAMING) | 0x80);
    }

    // Waiting for flags to be set
    int64_t timeout_time = esp_timer_get_time() + (25 * 1000); // 25ms timeout
    uint8_t n;
    bool response = false;
    do {
        n = rc522_read_reg(spi, RC522_REG_COMM_IRQ);

        if ((n & 0x01) || (n & 0b00110000)) {
            response = true;
            break;
        }

        vTaskDelay(pdMS_TO_TICKS(1));
        // when error (0x01) or transmission finished (48) [Rx & Idle]
    } while (esp_timer_get_time() < timeout_time); 

    // stop startsend (actually the module sets it to 0 when FIFO is empty, but just in case..)
    rc522_write_reg(spi, RC522_REG_BIT_FRAMING, rc522_read_reg(spi, RC522_REG_BIT_FRAMING) & 0x7F);

    if (!response) return ESP_ERR_TIMEOUT;

    // verify errors [9.2.1.7]
    uint8_t error_reg = rc522_read_reg(spi, RC522_REG_ERROR);
    // BufOverflow, CollErr, CRCErr, ParityErr, ProtocolErr
    if (error_reg & 0b00011111) return ESP_FAIL; 

    // getting data
    if (back_data != NULL && back_len != NULL) {
        //read number of bytes in fifo
        uint8_t fifo_len = rc522_read_reg(spi, RC522_REG_FIFO_LEVEL);
        if (fifo_len > *back_len) fifo_len = *back_len;
        
        *back_len = fifo_len;
        for (int i = 0; i < fifo_len; i++) {
            //read data from fifo
            back_data[i] = rc522_read_reg(spi, RC522_REG_FIFO_DATA);
        }
    }

    return ESP_OK;
}

static esp_err_t rc522_is_card_present(spi_device_handle_t spi) {
    uint8_t req_cmd = PICC_REQA;
    uint32_t back_bits = 0;
    
    // TxLastBits to 7: transmitting bytes to tag
    rc522_write_reg(spi, RC522_REG_BIT_FRAMING, 0b00000111);
    
    //send command to card: wake it up
    return rc522_to_card(spi, PCD_TRANSCEIVE, &req_cmd, 1, NULL, &back_bits);
}

static esp_err_t rc522_get_card_uid(spi_device_handle_t spi, uint8_t *uid, uint8_t *uid_len) {
    uint8_t valid_bits = 0;
    uint32_t back_len = 10; // Taille max de notre buffer de réception
    
    // Anticollision (for multiple cards) then reset
    uint8_t send_data[2] = { PICC_ANTICOLL, 0x20 };
    
    //TxLastBits, RxLastBits to 0 : comms with tag bit by bit
    rc522_write_reg(spi, RC522_REG_BIT_FRAMING, 0x00);
    
    //send data to card
    esp_err_t err = rc522_to_card(spi, PCD_TRANSCEIVE, send_data, 2, uid, &back_len);
    if (err == ESP_OK) {
        *uid_len = back_len - 1; // last byte = checksum
    }
    return err;
}

static void rc522_card_halt(spi_device_handle_t spi) {
    uint32_t back_len = 0;
    //ISO 14443A : 4 bytes for HALT : 2 commands + 2 crc on those 2 previous ones
    uint8_t send_data[4] = { PICC_HALT, 0x00, 0x00, 0x00 };
    
    // Hardcoded CRC for 0x50 then 0x00
    // 0x6363 and x^16 + x^12 + x^5 + 1
    send_data[2] = 0x57; 
    send_data[3] = 0xCD;

    rc522_to_card(spi, PCD_TRANSCEIVE, send_data, 4, NULL, &back_len);
}

static spi_device_handle_t rc522_spi_handle;

static esp_err_t init_rfid_rc522() {
    esp_err_t err;

    // master bus cfg
    spi_bus_config_t buscfg = {
        .miso_io_num = PIN_NUM_MISO,
        .mosi_io_num = PIN_NUM_MOSI,
        .sclk_io_num = PIN_NUM_CLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4096
    };

    err = spi_bus_initialize(SPI3_HOST, &buscfg, SPI_DMA_CH_AUTO);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) init SPI bus", esp_err_to_name(err));
        return err;
    }

    //cf datasheet
    spi_device_interface_config_t devcfg = {
        .clock_speed_hz = 4 * 1000 * 1000,  
        .mode = 0,                              
        .spics_io_num = PIN_NUM_CS,             
        .queue_size = 7,                   
    };

    err = spi_bus_add_device(SPI3_HOST, &devcfg, &rc522_spi_handle);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) init SPI bus", esp_err_to_name(err));
        return err;
    }

    // hard reset module
    gpio_reset_pin(PIN_NUM_RST);
    gpio_set_direction(PIN_NUM_RST, GPIO_MODE_OUTPUT);
    gpio_set_level(PIN_NUM_RST, 0);
    vTaskDelay(pdMS_TO_TICKS(50));
    gpio_set_level(PIN_NUM_RST, 1);
    vTaskDelay(pdMS_TO_TICKS(50));

    // rc522 version
    uint8_t version = rc522_read_reg(rc522_spi_handle, RC522_REG_VERSION);
    
    if (version == 0x00 || version == 0xFF) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "RC522 not responding");
        return ESP_FAIL;
    } else {
        log_msg(TAG, "RC522 detected, version: 0x%02X", version);
    }

    //activate antenna
    uint8_t tx_control = rc522_read_reg(rc522_spi_handle, RC522_REG_TX_CONTROL);
    if ((tx_control & 0b00000011) != 0b00000011) { //if tx1 & tx2 not set
        //then activate
        rc522_write_reg(rc522_spi_handle, RC522_REG_TX_CONTROL, tx_control | 0b00000011);
        log_msg(TAG, "Antenna 13.56Mhz activated");
    }

    // 100% ASK : cut emission at 100% then enables it to send bits
    rc522_write_reg(rc522_spi_handle, RC522_REG_TX_ASK, 0b01000000); 

