FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    // RxGain to 48dB and reserved to 1000 (default value)
    rc522_write_reg(rc522_spi_handle, RC522_REG_RF_CFG, 0b01111000);

    return err;
}

typedef struct rfid_rc522_info_st {
    uint8_t uid[16];
} rfid_rc522_info_t;

static void rfid_rc522_task(void * params) {
    esp_err_t err;

    err = init_rfid_rc522();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    rfid_rc522_info_t rfid_info = {0};
    uint8_t uid_len = 0;

    while (monitoring) {

        log_msg_lvl(ESP_LOG_DEBUG, TAG, "Antenna listening for 13.56MHz tag...");

        //ping to see if a card is here
        esp_err_t present_err = rc522_is_card_present(rc522_spi_handle);
        
        if (present_err == ESP_OK) {
            log_msg_lvl(ESP_LOG_DEBUG, TAG, "RF signal received, Reading UID...");
            
            esp_err_t uid_err = rc522_get_card_uid(rc522_spi_handle, rfid_info.uid, &uid_len);
            if (uid_err == ESP_OK) {

                if(uid_len > sizeof(rfid_info.uid)) {
                    uid_len = sizeof(rfid_info.uid);
                }
                
                log_msg_lvl(ESP_LOG_DEBUG, TAG, "Tag decoded");
                ESP_LOG_BUFFER_HEX(TAG, rfid_info.uid, uid_len);

                header_sensor_t header = {0};
                header.esp_id = (uint8_t)CONFIG_ESP_ID;
                header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
                header.type = SENSOR_TYPE_RFID_RC522;
                uint8_t buf[HEADER_SENSOR_SIZE + uid_len];
                serialize_header(&header, buf);
                memcpy(&buf[HEADER_SENSOR_SIZE], rfid_info.uid, uid_len);
                
            #if CONFIG_USE_UDPLIB
                send_udp_sensor(buf, sizeof(buf));
            #endif

                rc522_card_halt(rc522_spi_handle);
            } else {
                log_msg_lvl(ESP_LOG_WARN, TAG, "Error reading UID (%s)", esp_err_to_name(uid_err));
            }
        } else {
            log_msg_lvl(ESP_LOG_DEBUG, TAG, "No card detected (%s)", esp_err_to_name(present_err));
        }

        vTaskDelay(pdMS_TO_TICKS(500));
    }

    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_RCWL_0515

#define OUT_PIN 22

static SemaphoreHandle_t sem_rcwl = NULL;

static void IRAM_ATTR rcwl_out_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;
    
    xSemaphoreGiveFromISR(sem_rcwl, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_rcwl_0515() {

    esp_err_t err;

    if (sem_rcwl != NULL) {
        log_msg(TAG, "RCWL-0515 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_rcwl = xSemaphoreCreateBinary();
    if (sem_rcwl == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(OUT_PIN);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN);
        return err;
    }

    err = gpio_set_direction(OUT_PIN, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN);
        return err;
    }
    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN);
        return err;
    }
    err = gpio_isr_handler_add(OUT_PIN, rcwl_out_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN);
        return err;
    }

    log_msg(TAG, "RCWL-0515 initialized");
    return ESP_OK;
}

static void rcwl_task(void * params) {
    esp_err_t err;
    
    err = init_rcwl_0515();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    bool detected_motion = false;

    while (monitoring)
    {
        if (xSemaphoreTake(sem_rcwl, portMAX_DELAY) == pdTRUE) {
            detected_motion = gpio_get_level(OUT_PIN);

            log_msg(TAG, "rcwl edge value : %d", detected_motion);
    
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_RCWL_0515;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = detected_motion;
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_VL53L1X
#define VL_ADDR 0x29
#define VL_PERIOD 50 

#define XSHUT_GPIO 23

#define VL_REG_IDENTIFICATION 0x010F
#define VL_REG_FIRMWARE_BOOT  0x00E5
#define VL_REG_GPIO_STATUS   0x0031
#define VL_REG_INT_CLEAR      0x0086
#define VL_REG_START_RANGING  0x0087
#define VL_REG_RESULT_DIST    0x0096
#define VL_REG_RANGE_STATUS   0x0089

typedef struct {
    uint16_t distance; 
    uint8_t range_status;
} vl_info_t;
i2c_master_dev_handle_t vl_handle;

i2c_device_config_t vl_cfg = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7, 
    .device_address = VL_ADDR,             
    .scl_speed_hz = 400000,                
};

static const uint8_t VL53L1X_DEFAULT_CONFIGURATION[] = {
    0x12, 0x00, 0x00, 0x11, 0x02, 0x00, 0x02, 0x08, 0x00, 0x08, 0x10, 0x01, 0x01, 0x00, 0x00, 0x00,
    0x00, 0xff, 0x00, 0x0F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x20, 0x0b, 0x00, 0x00, 0x02, 0x0a, 0x21,
    0x00, 0x00, 0x05, 0x05, 0x15, 0x05, 0x03, 0x08, 0x03, 0x08, 0x35, 0x00, 0x03, 0x04, 0x03, 0x08,
    0x01, 0x01, 0x01, 0x00, 0x01, 0x0c, 0x00, 0x00, 0x00, 0x00, 0x20, 0x0b, 0x00, 0x00, 0x02, 0x0a,
    0x00, 0x00, 0x03, 0x01, 0x00, 0x02, 0x01, 0x01, 0x00, 0x01, 0x0c, 0x08, 0x01, 0x00, 0x00, 0x08,
    0x01, 0x14, 0x00, 0x00, 0x00, 0x07, 0x03, 0x05, 0x05, 0x15, 0x03
};

esp_err_t init_vl() {
    esp_err_t err;

    if (master_handle == NULL) {
        err = i2c_new_master_bus(&master_cfg, &master_handle);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) allocating I²C master bus", esp_err_to_name(err));
            return err;
        }
    }

