FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    err = i2c_master_bus_add_device(master_handle, &vl_cfg, &vl_handle);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding device to master bus", esp_err_to_name(err));
        return err;
    }

// 1. Vérification ID
    uint8_t reg_id[2] = { (VL_REG_IDENTIFICATION >> 8) & 0xFF, VL_REG_IDENTIFICATION & 0xFF };
    uint8_t buf_rec[2] = {0};
    err = i2c_master_transmit_receive(vl_handle, reg_id, 2, buf_rec, 2, pdMS_TO_TICKS(100));
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) reading sensor identification. Vérifie le câblage et XSHUT !", esp_err_to_name(err));
        return err;
    }

    uint16_t sensor_id = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];
    if (sensor_id != 0xEACC) {
        log_msg(TAG, "Error: Incorrect sensor ID 0x%04X (Attendu 0xEACC)", sensor_id);
        return ESP_ERR_INVALID_VERSION;
    }

    // 2. Attente du boot du firmware interne
    uint8_t boot_state = 0;
    uint8_t reg_boot[2] = { (VL_REG_FIRMWARE_BOOT >> 8) & 0xFF, VL_REG_FIRMWARE_BOOT & 0xFF };
    int retry = 50;
    
    while (retry > 0) {
        err = i2c_master_transmit_receive(vl_handle, reg_boot, 2, &boot_state, 1, pdMS_TO_TICKS(50));
        if (err == ESP_OK && (boot_state & 0x01) == 1) {
            break; 
        }
        vTaskDelay(pdMS_TO_TICKS(2));
        retry--;
    }

    if (retry == 0) {
        log_msg(TAG, "Error: Sensor firmware boot timeout (0x%02X)", boot_state);
        return ESP_ERR_TIMEOUT;
    }

    // 3. Écriture de la table de configuration d'usine globale
    uint8_t init_buf[2 + sizeof(VL53L1X_DEFAULT_CONFIGURATION)];
    init_buf[0] = 0x00;
    init_buf[1] = 0x2D;
    memcpy(&init_buf[2], VL53L1X_DEFAULT_CONFIGURATION, sizeof(VL53L1X_DEFAULT_CONFIGURATION));
    err = i2c_master_transmit(vl_handle, init_buf, sizeof(init_buf), pdMS_TO_TICKS(200));
    if (err != ESP_OK) {
        log_msg(TAG, "Error loading ULD init table");
        return err;
    }

    // Configuration Timing budget (50ms)
    uint8_t buf_tb1[3] = { 0x00, 0x5E, 0x00 };
    i2c_master_transmit(vl_handle, buf_tb1, 3, pdMS_TO_TICKS(50));
    uint8_t buf_tb2[3] = { 0x00, 0x5F, 0x1E };
    i2c_master_transmit(vl_handle, buf_tb2, 3, pdMS_TO_TICKS(50));

    // Démarrage de la télémétrie
    uint8_t buf_start[3] = { 0x00, 0x87, 0x40 };
    err = i2c_master_transmit(vl_handle, buf_start, 3, pdMS_TO_TICKS(50));
    if (err != ESP_OK) return err;

    // Clear initial de l'interruption pour lancer la première capture physique
    uint8_t buf_clear[3] = { 0x00, 0x86, 0x01 };
    err = i2c_master_transmit(vl_handle, buf_clear, 3, pdMS_TO_TICKS(50));
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) clearing initial interrupt", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(100)); // Laisser le temps au système de se stabiliser

    // Après le buf_start et buf_clear, avant le log "fully booted"
    uint8_t reg_check[2];
    uint8_t val = 0;

    reg_check[0] = 0x00; reg_check[1] = 0x87;
    i2c_master_transmit_receive(vl_handle, reg_check, 2, &val, 1, -1);
    log_msg(TAG, "0x0087 (MODE_START) = 0x%02X (attendu 0x40)", val);

    reg_check[0] = 0x00; reg_check[1] = 0x86;
    i2c_master_transmit_receive(vl_handle, reg_check, 2, &val, 1, -1);
    log_msg(TAG, "0x0086 (INT_CLEAR) = 0x%02X", val);

    reg_check[0] = 0x00; reg_check[1] = 0x31;
    i2c_master_transmit_receive(vl_handle, reg_check, 2, &val, 1, -1);
    log_msg(TAG, "0x0031 (GPIO_STATUS) = 0x%02X (attendu 0x03 avant mesure)", val);

    // Attente active 200ms pour laisser le temps au capteur de faire une mesure
    vTaskDelay(pdMS_TO_TICKS(200));

    reg_check[0] = 0x00; reg_check[1] = 0x31;
    i2c_master_transmit_receive(vl_handle, reg_check, 2, &val, 1, -1);
    log_msg(TAG, "0x0031 après 200ms = 0x%02X (attendu 0x01 si mesure prête)", val);

    reg_check[0] = 0x00; reg_check[1] = 0x89;
    i2c_master_transmit_receive(vl_handle, reg_check, 2, &val, 1, -1);
    log_msg(TAG, "0x0089 (RANGE_STATUS) = 0x%02X", val);

    

    log_msg(TAG, "VL53L1X fully booted and operational");
    return ESP_OK;
}
esp_err_t get_vl_info(vl_info_t *vl_info) {
    if (vl_info == NULL) return ESP_ERR_INVALID_ARG;

    esp_err_t err;
    uint8_t reg_ptr[2];
    uint8_t buf_rec[2];
    uint8_t status = 0;

    // 1. Lecture de l'état de la mesure via le registre 0x0031
    reg_ptr[0] = (VL_REG_GPIO_STATUS >> 8) & 0xFF;
    reg_ptr[1] = VL_REG_GPIO_STATUS & 0xFF;

    err = i2c_master_transmit_receive(vl_handle, reg_ptr, 2, &status, 1, pdMS_TO_TICKS(50));
    if (err != ESP_OK) return err;

    // 💡 Avec 0x0031, la valeur 0x03 signifie "pas encore prêt"
    if (status == 0x03) {
        return ESP_ERR_NOT_FINISHED;
    }

    // 2. Lecture du Diagnostic Range Status (Registre 0x0089)
    uint8_t reg_status[2] = { (VL_REG_RANGE_STATUS >> 8) & 0xFF, VL_REG_RANGE_STATUS & 0xFF };
    err = i2c_master_transmit_receive(vl_handle, reg_status, 2, &vl_info->range_status, 1, pdMS_TO_TICKS(50));
    if (err != ESP_OK) return err;

    // 3. Lecture de la distance calculée (2 octets Big Endian depuis 0x0096)
    reg_ptr[0] = (VL_REG_RESULT_DIST >> 8) & 0xFF;
    reg_ptr[1] = VL_REG_RESULT_DIST & 0xFF;

    err = i2c_master_transmit_receive(vl_handle, reg_ptr, 2, buf_rec, 2, pdMS_TO_TICKS(50));
    if (err != ESP_OK) return err;
    
    vl_info->distance = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    // 4. Libération de l'interruption (Obligatoire pour que le capteur fasse la mesure suivante)
    uint8_t buf_clear[3] = { (VL_REG_INT_CLEAR >> 8) & 0xFF, VL_REG_INT_CLEAR & 0xFF, 0x01 };
    err = i2c_master_transmit(vl_handle, buf_clear, 3, pdMS_TO_TICKS(50));
    if (err != ESP_OK) return err;

    return ESP_OK;
}
#define VL_PAYLOAD_SIZE (sizeof(uint16_t))

static void serialize_vl(vl_info_t *vl, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE;
    memcpy(&buf[len], &vl->distance, sizeof(uint16_t));
}

static void vl_task(void * params) {
    esp_err_t err;
    vl_info_t vl_info;

    err = init_vl();
    if (err != ESP_OK){
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) init vl", esp_err_to_name(err));
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
         uint8_t reg_ptr[2] = { 0x00, 0x31 };
        uint8_t status = 0;
        i2c_master_transmit_receive(vl_handle, reg_ptr, 2, &status, 1, -1);
        log_msg(TAG, "GPIO status 0x0031 = 0x%02X", status);  // <-- debug

        err = get_vl_info(&vl_info);

        if (err == ESP_OK) {
            // 💡 Analyse du Range Status selon la Datasheet ST :
            // 0 = Mesure Parfaite
            // 1 = Sigma Failure (Trop de pollution lumineuse ambiante)
            // 2 = Signal Failure (Cible trop sombre ou trop loin, pas assez de retour laser)
            // 4 = Out of Bounds (Cible hors de portée)
            if (vl_info.range_status == 0) {
                log_msg(TAG, "dist : %u mm", vl_info.distance);
            } else {
                log_msg(TAG, "dist brute : %u mm (Statut d'erreur laser: %d)", vl_info.distance, vl_info.range_status);
            }
            
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_VL53L1X; 
            uint8_t buf[HEADER_SENSOR_SIZE + VL_PAYLOAD_SIZE];
            
            serialize_header(&header, buf);
            serialize_vl(&vl_info, buf);
            
