FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        } 
        else if (err == ESP_ERR_NOT_FINISHED) {
            // Le capteur est en cours d'acquisition active. On passe calmement au cycle suivant.
        } 
        else {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Erreur critique de communication I2C (%s)", esp_err_to_name(err));
        }

        vTaskDelay(pdMS_TO_TICKS(VL_PERIOD));
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_AS5600

#define AS5600_SENS_ADDR            0x36   
#define AS5600_REG_ANGLE_MSB        0x0E   

i2c_device_config_t as_config = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7,
    .device_address = AS5600_SENS_ADDR,
    .scl_speed_hz = 400000,
};
i2c_master_dev_handle_t as_handle;

esp_err_t init_as() {
    esp_err_t err;

    if (master_handle == NULL) {
        err = i2c_new_master_bus(&master_cfg, &master_handle);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) allocating I²C master bus", esp_err_to_name(err));
            return err;
        }
    }

    err = i2c_master_bus_add_device(master_handle, &as_config, &as_handle);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding device to master bus", esp_err_to_name(err));
        return err;
    }

    log_msg(TAG, "AS5600 initialized");
    return ESP_OK;
}

    
static void as_task(void * params) {
    esp_err_t err;

    err = init_as();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    uint8_t reg_addr = AS5600_REG_ANGLE_MSB;
    uint8_t data_rd[2] = {0};

    monitoring = true;
    while (monitoring)
    {
        err = i2c_master_transmit_receive(as_handle, &reg_addr, 1, data_rd, 2, -1);

        if (err == ESP_OK) {

            uint16_t raw_angle = ((data_rd[0] & 0x0F) << 8) | data_rd[1];
            float degrees = (raw_angle * 360.0f) / 4096.0f;

            log_msg(TAG, "Raw angle : %d | Deg: %.2f°", raw_angle, degrees);
            
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_AS5600; 
            uint8_t buf[HEADER_SENSOR_SIZE + 2];
            
            serialize_header(&header, buf);
            memcpy(&buf[HEADER_SENSOR_SIZE], data_rd, 2);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        } else {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "I2C comm error (%s)", esp_err_to_name(err));
        }

        vTaskDelay(pdMS_TO_TICKS(100));
    }
    vTaskDelete(NULL);
}
#endif

#if CONFIG_USE_KY003

#define OUT_PIN_KY_003 23

typedef struct ky_info_st {
    uint64_t signal_count;
    int64_t signal_duration;
} ky_info_t;

static volatile uint8_t pulse_count = 0;
static portMUX_TYPE pulse_spinlock = portMUX_INITIALIZER_UNLOCKED;

static void IRAM_ATTR ky_003_out_isr_handler(void* arg)
{
    taskENTER_CRITICAL_ISR(&pulse_spinlock);
    pulse_count++;
    taskEXIT_CRITICAL_ISR(&pulse_spinlock);
}

static esp_err_t init_ky_003() {

    esp_err_t err;

    err = gpio_reset_pin(OUT_PIN_KY_003);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY_003);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY_003, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY_003);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY_003, GPIO_INTR_POSEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY_003);
        return err;
    }
    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY_003);
        return err;
    }
    err = gpio_isr_handler_add(OUT_PIN_KY_003, ky_003_out_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY_003);
        return err;
    }

    log_msg(TAG, "KY-003 initialized");
    return ESP_OK;
}

static void ky_003_task(void * params) {
    esp_err_t err;
    
    err = init_ky_003();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    uint32_t total_pulses = 0;

    while (monitoring)
    {
    
        taskENTER_CRITICAL(&pulse_spinlock);
        uint8_t temp_pulse = pulse_count;
        pulse_count = 0;
        taskEXIT_CRITICAL(&pulse_spinlock);

        total_pulses += temp_pulse;
        
        header_sensor_t header = {0};
        header.esp_id = (uint8_t)CONFIG_ESP_ID;
        header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
        header.type = SENSOR_TYPE_KY003;
        uint8_t buf[HEADER_SENSOR_SIZE + 1];
        serialize_header(&header, buf);
        buf[HEADER_SENSOR_SIZE] = temp_pulse;

        log_msg(TAG, "count: %u/%u, RPM: %.2f", temp_pulse, total_pulses, (temp_pulse / 100e-3) * 60.0);
        

    #if CONFIG_USE_UDPLIB
        send_udp_sensor(buf, sizeof(buf));
    #endif
    #if CONFIG_USE_ESPNOW
    #endif
        
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    vTaskDelete(NULL);
}
    

#endif

#if CONFIG_USE_FC33

#define OUT_PIN_FC33 23

static volatile uint8_t pulse_count_fc33 = 0;
static portMUX_TYPE pulse_spinlock_fc33 = portMUX_INITIALIZER_UNLOCKED;

static void IRAM_ATTR fc33_out_isr_handler(void* arg)
{
    taskENTER_CRITICAL_ISR(&pulse_spinlock_fc33);
    pulse_count_fc33++;
    taskEXIT_CRITICAL_ISR(&pulse_spinlock_fc33);
}

static esp_err_t init_fc33() {

    esp_err_t err;

    err = gpio_reset_pin(OUT_PIN_FC33);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_FC33);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_FC33, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_FC33);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_FC33, GPIO_INTR_NEGEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_FC33);
        return err;
    }
    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_FC33);
        return err;
    }
    err = gpio_isr_handler_add(OUT_PIN_FC33, fc33_out_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_FC33);
        return err;
    }

    log_msg(TAG, "FC-33 initialized");
    return ESP_OK;
}

