FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
static void fc_33_task(void * params) {
    esp_err_t err;
    
    err = init_fc33();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    uint32_t total_pulses = 0;

    while (monitoring)
    {
    
        taskENTER_CRITICAL(&pulse_spinlock_fc33);
        uint8_t temp_pulse = pulse_count_fc33;
        pulse_count_fc33 = 0;
        taskEXIT_CRITICAL(&pulse_spinlock_fc33);

        total_pulses += temp_pulse;
        
        header_sensor_t header = {0};
        header.esp_id = (uint8_t)CONFIG_ESP_ID;
        header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
        header.type = SENSOR_TYPE_FC33;
        uint8_t buf[HEADER_SENSOR_SIZE + 1];
        serialize_header(&header, buf);
        buf[HEADER_SENSOR_SIZE] = temp_pulse;

        log_msg(TAG, "count: %u/%u, RPM: %.2f", temp_pulse, total_pulses, (temp_pulse / 100e-3) * 60.0);
        

    #if CONFIG_USE_UDPLIB
        send_udp_sensor(buf, sizeof(buf));
    #endif
    #if CONFIG_USE_ESPNOW
    #endif
        
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    vTaskDelete(NULL);
}
    

#endif

#if CONFIG_USE_KY033

#define OUT_PIN_KY033 8

static pcnt_unit_handle_t pcnt_unit_ky033 = NULL;
static volatile uint16_t pulses_count_20ms = 0;
static volatile uint16_t pulses_count_100ms = 0;

static esp_err_t init_ky033() {

    esp_err_t err;
// 1. Configuration de l'unité de comptage matérielle
    pcnt_unit_config_t unit_config = {
        .high_limit = 20000, // Limite haute max avant overflow (sécurité)
        .low_limit = -1,     // On ne compte pas à l'envers
    };
    err = pcnt_new_unit(&unit_config, &pcnt_unit_ky033);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) creating PCNT unit", esp_err_to_name(err));
        return err;
    }

    // 2. Configuration du Glitch Filter (Anti-mitraillette matériel)
    // On ignore tout signal plus court que 50 000 ns (50 microsecondes)
    pcnt_glitch_filter_config_t filter_config = {
        .max_glitch_ns = 10000,
    };
    err = pcnt_unit_set_glitch_filter(pcnt_unit_ky033, &filter_config);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting PCNT glitch filter", esp_err_to_name(err));
        return err;
    }

    // 3. Configuration du canal et assignation du GPIO 23
    pcnt_chan_config_t chan_config = {
        .edge_gpio_num = OUT_PIN_KY033,
        .level_gpio_num = -1, // Pas de pin de direction, on avance seulement
    };
    pcnt_channel_handle_t pcnt_chan = NULL;
    err = pcnt_new_channel(pcnt_unit_ky033, &chan_config, &pcnt_chan);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) creating PCNT channel", esp_err_to_name(err));
        return err;
    }

    // 4. Assignation des actions sur les fronts (Équivalent du NEGEDGE)
    // Front montant (pos) -> On maintient l'état (HOLD)
    // Front descendant (neg) -> On incrémente le compteur (INCREASE)
    err = pcnt_channel_set_edge_action(pcnt_chan, 
                                       PCNT_CHANNEL_EDGE_ACTION_HOLD, 
                                       PCNT_CHANNEL_EDGE_ACTION_INCREASE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting PCNT edge action", esp_err_to_name(err));
        return err;
    }

    // 5. Activation et démarrage du module autonome
    err = pcnt_unit_enable(pcnt_unit_ky033);
    if (err != ESP_OK) return err;

    err = pcnt_unit_start(pcnt_unit_ky033);
    if (err != ESP_OK) return err;

    log_msg(TAG, "KY-033 initialized");
    return ESP_OK;
}

#define SLIDING_WINDOW_SIZE 5

static uint16_t pulse_history[SLIDING_WINDOW_SIZE] = {0};
static uint8_t history_idx = 0;

static void ky033_task(void * params) {
    esp_err_t err;
    
    err = init_ky033();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    uint32_t total_pulses = 0;
    monitoring = true;
    uint8_t reset_count = 0;

    while (monitoring)
    {
        int pcnt_count = 0;

        // On récupère directement la valeur lue par le silicium
        pcnt_unit_get_count(pcnt_unit_ky033, &pcnt_count);
        // On remet immédiatement à zéro pour la frame de 100ms suivante
        pcnt_unit_clear_count(pcnt_unit_ky033);

        pulses_count_20ms = (uint16_t)pcnt_count;
        total_pulses += pulses_count_20ms;

        pulse_history[history_idx] = pulses_count_20ms;
        history_idx = (history_idx + 1) % SLIDING_WINDOW_SIZE;

        uint16_t current_100ms_sum = 0;
        for (uint8_t i = 0; i < SLIDING_WINDOW_SIZE; i++) {
            current_100ms_sum += pulse_history[i];
        }
        pulses_count_100ms = current_100ms_sum;

        reset_count++;
        if (reset_count == 5) {
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY033;
            uint8_t buf[HEADER_SENSOR_SIZE + 4];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = (uint8_t)pulses_count_100ms;
            int16_t motor = -1001;
            bool motor_sign_positive = false;

        #if CONFIG_USE_LEDLIB
            err = get_motor_percent(&motor);
            if (err != ESP_OK) {
                log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) reading MOTOR", esp_err_to_name(err));
            }
            err = get_last_motor_sign_positive(&motor_sign_positive);
            if (err != ESP_OK) {
                log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) reading MOTOR", esp_err_to_name(err));
            }
        #endif
            memcpy(&buf[HEADER_SENSOR_SIZE + 1], &motor, sizeof(int16_t));
            buf[HEADER_SENSOR_SIZE + 3] = (uint8_t)motor_sign_positive;
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
            log_msg_lvl(ESP_LOG_DEBUG, TAG, "Send udp ky033, 100ms: %u, 20ms: %u, reset_count: %u",
                pulses_count_100ms, pulses_count_20ms, reset_count
            );
            reset_count = 0;
        }
        vTaskDelay(pdMS_TO_TICKS(20));
    }
    vTaskDelete(NULL);
}

#endif

esp_err_t get_pulses_count_20ms(uint16_t *count) {
    #if CONFIG_USE_KY033
    *count = pulses_count_20ms;
    return ESP_OK;
    #else
    return ESP_ERR_INVALID_STATE;
    #endif
}

esp_err_t get_pulses_count_100ms(uint16_t *count) {
    #if CONFIG_USE_KY033
    *count = pulses_count_100ms;
    return ESP_OK;
    #else
    return ESP_ERR_INVALID_STATE;
    #endif
}

#if CONFIG_USE_KY002

