FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
#define OUT_PIN_KY002 23

static volatile uint8_t pulse_count_ky002 = 0;
static portMUX_TYPE pulse_spinlock_ky002 = portMUX_INITIALIZER_UNLOCKED;

static void IRAM_ATTR ky002_out_isr_handler(void* arg)
{
    taskENTER_CRITICAL_ISR(&pulse_spinlock_ky002);
    pulse_count_ky002++;
    taskEXIT_CRITICAL_ISR(&pulse_spinlock_ky002);
}

static esp_err_t init_ky002() {

    esp_err_t err;

    err = gpio_reset_pin(OUT_PIN_KY002);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY002);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY002, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY002);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY002, GPIO_INTR_NEGEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY002);
        return err;
    }
    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY002);
        return err;
    }
    err = gpio_isr_handler_add(OUT_PIN_KY002, ky002_out_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY002);
        return err;
    }

    log_msg(TAG, "FC-33 initialized");
    return ESP_OK;
}

static void ky002_task(void * params) {
    esp_err_t err;
    
    err = init_ky002();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    uint32_t total_pulses = 0;

    while (monitoring)
    {
    
        taskENTER_CRITICAL(&pulse_spinlock_ky002);
        uint8_t temp_pulse = pulse_count_ky002;
        pulse_count_ky002 = 0;
        taskEXIT_CRITICAL(&pulse_spinlock_ky002);

        total_pulses += temp_pulse;
        
        header_sensor_t header = {0};
        header.esp_id = (uint8_t)CONFIG_ESP_ID;
        header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
        header.type = SENSOR_TYPE_KY002;
        uint8_t buf[HEADER_SENSOR_SIZE + 1];
        serialize_header(&header, buf);
        buf[HEADER_SENSOR_SIZE] = temp_pulse;

        log_msg(TAG, "count: %u/%u, RPM: %.2f", temp_pulse, total_pulses, (temp_pulse / 100e-3) * 60.0);
        

    #if CONFIG_USE_UDPLIB
        send_udp_sensor(buf, sizeof(buf));
    #endif
    #if CONFIG_USE_ESPNOW
    #endif
        
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    vTaskDelete(NULL);
}
    

#endif


#if CONFIG_USE_KY040

#if CONFIG_USE_LEDLIB
#include "ledLib.h"
#endif

#define SW_PIN_KY040 22
#define DT_PIN_KY040 21
#define CLK_PIN_KY040 23

static esp_err_t setup_pin(gpio_num_t gpio_num) {

    esp_err_t err = ESP_OK; 
    
    err = gpio_reset_pin(gpio_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), gpio_num);
        return err;
    }

    err = gpio_set_direction(gpio_num, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), gpio_num);
        return err;
    }

    err = gpio_set_intr_type(gpio_num, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), gpio_num);
        return err;
    }
    return err;
}

static SemaphoreHandle_t sem_ky040 = NULL;

static volatile bool clk_val = false;
static volatile bool dt_val = false;

static void IRAM_ATTR ky040_sw_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;
    
    xSemaphoreGiveFromISR(sem_ky040, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static void IRAM_ATTR ky040_dt_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    dt_val = true;
    xSemaphoreGiveFromISR(sem_ky040, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static void IRAM_ATTR ky040_clk_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    clk_val = true;
    xSemaphoreGiveFromISR(sem_ky040, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky040() {

    esp_err_t err;

    if (sem_ky040 != NULL) {
        log_msg(TAG, "KY-040 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky040 = xSemaphoreCreateBinary();
    if (sem_ky040 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = setup_pin(SW_PIN_KY040);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setup pin %d", esp_err_to_name(err), SW_PIN_KY040);
        return err;
    }
    err = setup_pin(DT_PIN_KY040);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setup pin %d", esp_err_to_name(err), DT_PIN_KY040);
        return err;
    }
    err = setup_pin(CLK_PIN_KY040);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setup pin %d", esp_err_to_name(err), CLK_PIN_KY040);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), SW_PIN_KY040);
        return err;
    }

    err = gpio_isr_handler_add(SW_PIN_KY040, ky040_sw_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), SW_PIN_KY040);
        return err;
    }
    err = gpio_isr_handler_add(DT_PIN_KY040, ky040_dt_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), DT_PIN_KY040);
        return err;
    }
    err = gpio_isr_handler_add(CLK_PIN_KY040, ky040_clk_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), CLK_PIN_KY040);
        return err;
    }

    log_msg(TAG, "KY-040 initialized");
    return ESP_OK;
}

static void ky040_task(void * params) {
    esp_err_t err;
    
    err = init_ky040();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    bool sw_button = false;

    int8_t factor = 0;

    int8_t val = -1;

#if CONFIG_USE_LEDLIB
    int8_t percent = 0;
#endif

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky040, portMAX_DELAY) == pdTRUE) {

            if (!clk_val && !dt_val) {
                //if sw button clicked
                sw_button = gpio_get_level(SW_PIN_KY040);
                //log_msg(TAG, "button value : %d", !sw_button);
                val = sw_button;
            } else if (!clk_val && dt_val) {
                //if dt before clk, turn left
                factor = -1;
            } else if (clk_val && !dt_val) {
                //if clk before dt, turn right
                factor = 1;
            } else {
                // both equal true -> clk and dt ok, trigger activate event
                //log_msg(TAG, "turn %s", factor == 1 ? "right" : "left");
                val = factor == 1 ? 3 : 2;
                dt_val = false;
                clk_val = false;
            }
    
