FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
            if (val != -1) {

            #if CONFIG_USE_LEDLIB
                if (val > 1) {
                    percent += factor;
                    if (percent < 0) percent = 0;
                    else if (percent > 100) percent = 100;
                    else ledc_buzzer(percent);
                }
            #endif
                header_sensor_t header = {0};
                header.esp_id = (uint8_t)CONFIG_ESP_ID;
                header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
                header.type = SENSOR_TYPE_KY040;
                uint8_t buf[HEADER_SENSOR_SIZE + 1];
                serialize_header(&header, buf);
                buf[HEADER_SENSOR_SIZE] = val;
                log_msg(TAG, "send val : %d", val);
            #if CONFIG_USE_UDPLIB
                send_udp_sensor(buf, sizeof(buf));
            #endif
            #if CONFIG_USE_ESPNOW
            #endif
                val = -1;
            }
        }
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_DHT11

#define OUT_PIN_DHT11 21

static rmt_channel_handle_t dht11_rx_chan = NULL;
static SemaphoreHandle_t dht11_rx_sem = NULL;
static rmt_symbol_word_t dht11_rx_buffer[64];

static bool IRAM_ATTR dht11_rmt_rx_done_callback(rmt_channel_handle_t channel, const rmt_rx_done_event_data_t *edata, void *user_data)
{
    BaseType_t high_task_wakeup = pdFALSE;
    xSemaphoreGiveFromISR(dht11_rx_sem, &high_task_wakeup);
    return high_task_wakeup == pdTRUE;
}

static esp_err_t init_dht11() {
    esp_err_t err;

    // 1. Configuration permanente du GPIO en Open-Drain Input/Output avec Pull-Up
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << OUT_PIN_DHT11),
        .mode = GPIO_MODE_INPUT_OUTPUT_OD,
        .pull_up_en = GPIO_PULLUP_ENABLE, // Pull-up interne activé (externe recommandé de 4.7k)
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io_conf);
    gpio_set_level(OUT_PIN_DHT11, 1); // Ligne au repos à '1'

    // 2. Création du sémaphore
    dht11_rx_sem = xSemaphoreCreateBinary();
    if (dht11_rx_sem == NULL) {
        log_msg(TAG, "Error creating DHT11 semaphore");
        return ESP_ERR_NO_MEM;
    }

    // 3. Configuration RMT RX
    rmt_rx_channel_config_t rx_config = {
        .gpio_num = OUT_PIN_DHT11,
        .clk_src = RMT_CLK_SRC_DEFAULT,
        .resolution_hz = 1000000, // 1 us / tick
        .mem_block_symbols = 64,
    };

    err = rmt_new_rx_channel(&rx_config, &dht11_rx_chan);
    if (err != ESP_OK) return err;

    rmt_rx_event_callbacks_t cbs = {
        .on_recv_done = dht11_rmt_rx_done_callback,
    };

    err = rmt_rx_register_event_callbacks(dht11_rx_chan, &cbs, NULL);
    if (err != ESP_OK) return err;

    err = rmt_enable(dht11_rx_chan);
    if (err != ESP_OK) return err;

    log_msg(TAG, "DHT11 RMT initialized");
    return ESP_OK;
}

static void dht11_task(void * params) {
    esp_err_t err = init_dht11();
    if (err != ESP_OK) {
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        // 1. SIGNAL START (Maintien à '0' pendant 20ms)
        gpio_set_level(OUT_PIN_DHT11, 0);
        vTaskDelay(pdMS_TO_TICKS(20));

        // 2. RELÂCHEMENT À '1' + PAUSE DE 25µs (Spécification DHT11)
        gpio_set_level(OUT_PIN_DHT11, 1);
        esp_rom_delay_us(25); // Laisse la ligne remonter avant que le DHT11 ne réponde

        // 3. ARMEMENT DU RMT JUSTE AU BON MOMENT
        rmt_receive_config_t receive_config = {
            .signal_range_min_ns = 1000,   // Filtre les parasites < 1us
            .signal_range_max_ns = 150000, // Timeout si la ligne reste inactive 150us
        };
        rmt_receive(dht11_rx_chan, dht11_rx_buffer, sizeof(dht11_rx_buffer), &receive_config);

        // 4. ATTENTE DE LA RÉCEPTION
        if (xSemaphoreTake(dht11_rx_sem, pdMS_TO_TICKS(100)) == pdTRUE) 
        {
            uint8_t data[5] = {0};

            // RECHERCHE DYNAMIQUE DU HANDSHAKE (Signal bas du DHT11 entre 60us et 100us)
            int start_index = -1;
            for (int i = 0; i < 5; i++) {
                uint32_t dur0 = dht11_rx_buffer[i].duration0;
                uint32_t dur1 = dht11_rx_buffer[i].duration1;

                // Le handshake du DHT11 est un niveau BAS (~80us) suivi d'un niveau HAUT (~80us)
                if ((dur0 >= 50 && dur0 <= 110) && (dur1 >= 50 && dur1 <= 110)) {
                    start_index = i + 1; // Les 40 bits de données commencent juste après
                    break;
                }
            }

            if (start_index != -1) {
                // DÉCODAGE DES 40 BITS
                for (int i = 0; i < 40; i++) {
                    rmt_symbol_word_t sym = dht11_rx_buffer[start_index + i];
                    
                    uint32_t low_dur  = (sym.level0 == 0) ? sym.duration0 : sym.duration1;
                    uint32_t high_dur = (sym.level0 == 1) ? sym.duration0 : sym.duration1;

                    // Un bit '1' a une durée HAUTE (>40us) supérieure à la durée BASSE (~50us)
                    if (high_dur > low_dur) {
                        data[i / 8] |= (1 << (7 - (i % 8)));
                    }
                }

                // VÉRIFICATION DU CHECKSUM
                if (data[4] == ((data[0] + data[1] + data[2] + data[3]) & 0xFF)) 
                {
                    uint8_t humidity = data[0];
                    uint8_t temperature = data[2];

                    //log_msg(TAG, "DHT11 humidity: %u%%, temp: %u°C", humidity, temperature);
                            
                    header_sensor_t header = {0};
                    header.esp_id = (uint8_t)CONFIG_ESP_ID;
                    header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
                    header.type = SENSOR_TYPE_DHT11;
                    uint8_t buf[HEADER_SENSOR_SIZE + 2];
                    serialize_header(&header, buf);
                    buf[HEADER_SENSOR_SIZE] = humidity;
                    buf[HEADER_SENSOR_SIZE + 1] = temperature;
                    
