FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
                #if CONFIG_USE_UDPLIB
                    send_udp_sensor(buf, sizeof(buf));
                #endif
                } 
                else {
                    log_msg(TAG, "Checksum failed | Raw: H=%d%% T=%d°C | Calc: %d vs Recv: %d", 
                            data[0], data[2], 
                            ((data[0] + data[1] + data[2] + data[3]) & 0xFF), data[4]);
                }
            } else {
                // LOG DE DEBUG : Affiche les 3 premiers symboles reçus si le Handshake n'est pas trouvé
                log_msg(TAG, "Handshake not found! Sym0: L0=%d D0=%ld, L1=%d D1=%ld | Sym1: L0=%d D0=%ld, L1=%d D1=%ld",
                        dht11_rx_buffer[0].level0, dht11_rx_buffer[0].duration0,
                        dht11_rx_buffer[0].level1, dht11_rx_buffer[0].duration1,
                        dht11_rx_buffer[1].level0, dht11_rx_buffer[1].duration0,
                        dht11_rx_buffer[1].level1, dht11_rx_buffer[1].duration1);
            }
        } 
        else {
            log_msg(TAG, "DHT11 RMT Response Timeout");
        }
        
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_DS18B20

#include "driver/gpio.h"
#include "esp_rom_sys.h"
#include "freertos/portmacro.h"

#define OUT_PIN_DS18B20 23 // Pin GPIO de ta sonde

static portMUX_TYPE ds_spinlock = portMUX_INITIALIZER_UNLOCKED;

// --- 1. PRIMITIVES TIMING 1-WIRE MATÉRIEL ---

// Signal de Reset et détection de présence
static bool ds18b20_reset(void) {
    bool presence = false;

    taskENTER_CRITICAL(&ds_spinlock);

    // 1. Reset Pulse : Ligne à 0 pendant 480 µs mesurées à l'horloge
    int64_t start = esp_timer_get_time();
    gpio_set_level(OUT_PIN_DS18B20, 0);
    while ((esp_timer_get_time() - start) < 480);

    // 2. Relâchement de la ligne
    gpio_set_level(OUT_PIN_DS18B20, 1);
    
    // 3. Mesure exacte du temps où la ligne reste à 0 dans les 500 µs suivantes
    start = esp_timer_get_time();
    int64_t low_start = 0;
    int64_t low_duration = 0;

    while ((esp_timer_get_time() - start) < 500) {
        if (gpio_get_level(OUT_PIN_DS18B20) == 0) {
            if (!presence) {
                presence = true;
                low_start = esp_timer_get_time() - start; // Moment où la sonde a répondu
            }
            low_duration++;
        }
    }

    taskEXIT_CRITICAL(&ds_spinlock);

    if (presence) {
        log_msg(TAG, "Sonde détectée ! Réponse après %lld µs (Durée bas: %lld µs)", low_start, low_duration);
    } else {
        log_msg(TAG, "Aucune réponse détectée sur 500 µs");
    }

    return presence;
}

// Écriture d'un bit
static void ds18b20_write_bit(bool bit) {
    taskENTER_CRITICAL(&ds_spinlock);
    gpio_set_level(OUT_PIN_DS18B20, 0);

    if (bit) {
        // Ecrire '1' : Impulsion basse très courte (1 à 15µs), puis relâchement
        esp_rom_delay_us(6);
        gpio_set_level(OUT_PIN_DS18B20, 1);
        esp_rom_delay_us(64);
    } else {
        // Ecrire '0' : Maintien au niveau bas pendant 60µs
        esp_rom_delay_us(60);
        gpio_set_level(OUT_PIN_DS18B20, 1);
        esp_rom_delay_us(10);
    }
    taskEXIT_CRITICAL(&ds_spinlock);
}

// Lecture d'un bit
static bool ds18b20_read_bit(void) {
    bool bit = false;

    taskENTER_CRITICAL(&ds_spinlock);
    gpio_set_level(OUT_PIN_DS18B20, 0);
    esp_rom_delay_us(2); // Impulsion de démarrage du slot (> 1µs)
    
    gpio_set_level(OUT_PIN_DS18B20, 1); // Relâchement de la ligne
    esp_rom_delay_us(10); // Échantillonnage à t = 12µs (doit être fait avant 15µs)
    
    bit = (gpio_get_level(OUT_PIN_DS18B20) != 0);
    taskEXIT_CRITICAL(&ds_spinlock);

    esp_rom_delay_us(50); // Fin du slot de lecture (60µs min)
    return bit;
}

// Écriture d'un octet (LSB First)
static void ds18b20_write_byte(uint8_t data) {
    for (int i = 0; i < 8; i++) {
        ds18b20_write_bit((data >> i) & 0x01);
    }
}

// Lecture d'un octet (LSB First)
static uint8_t ds18b20_read_byte(void) {
    uint8_t value = 0;
    for (int i = 0; i < 8; i++) {
        if (ds18b20_read_bit()) {
            value |= (1 << i);
        }
    }
    return value;
}

// Calcul du Checksum CRC8 Maxim/Dallas (Polynôme x^8 + x^5 + x^4 + 1)
static uint8_t ds18b20_crc8(const uint8_t *addr, uint8_t len) {
    uint8_t crc = 0;
    while (len--) {
        uint8_t inbyte = *addr++;
        for (uint8_t i = 8; i; i--) {
            uint8_t mix = (crc ^ inbyte) & 0x01;
            crc >>= 1;
            if (mix) crc ^= 0x8C;
            inbyte >>= 1;
        }
    }
    return crc;
}

// --- 2. INITIALISATION GPIO ---

static esp_err_t init_ds18b20() {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << OUT_PIN_DS18B20),
        .mode = GPIO_MODE_INPUT_OUTPUT_OD, // Open-Drain I/O
        .pull_up_en = GPIO_PULLUP_ENABLE,  // Pull-up interne
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io_conf);
    gpio_set_level(OUT_PIN_DS18B20, 1); // Ligne au repos à 1

    if (!ds18b20_reset()) {
        log_msg(TAG, "DS18B20 presence pulse not detected!");
        return ESP_ERR_NOT_FOUND;
    }

    log_msg(TAG, "DS18B20 1-Wire manual driver initialized");
    return ESP_OK;
}

// --- 3. TÂCHE FREERTOS ---

static void ds18b20_task(void * params) {
    esp_err_t err = init_ds18b20();
    if (err != ESP_OK) {
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        // 1. DEMANDE DE CONVERSION DE TEMPÉRATURE (Convert T)
        if (ds18b20_reset()) 
        {
            ds18b20_write_byte(0xCC); // SKIP ROM (S'adresse à l'unique capteur sur le bus)
            ds18b20_write_byte(0x44); // CONVERT T

            // La conversion 12-bit prend jusqu'à 750ms en interne dans la sonde
            vTaskDelay(pdMS_TO_TICKS(800));

            // 2. LECTURE DU SCRATCHPAD
            if (ds18b20_reset()) 
            {
                ds18b20_write_byte(0xCC); // SKIP ROM
                ds18b20_write_byte(0xBE); // READ SCRATCHPAD

                uint8_t scratchpad[9];
                for (int i = 0; i < 9; i++) {
                    scratchpad[i] = ds18b20_read_byte();
                }

