FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
                // 3. VÉRIFICATION DU CHECKSUM (CRC8)
                uint8_t calculated_crc = ds18b20_crc8(scratchpad, 8);
                if (calculated_crc == scratchpad[8]) 
                {
                    // Assemblage des 16 bits (LSB = Byte 0, MSB = Byte 1)
                    int16_t raw_temp = (scratchpad[1] << 8) | scratchpad[0];
                    
                    // La résolution 12-bit donne 0.0625°C par LSB
                    float temp_c = raw_temp * 0.0625f;
                    int16_t temp_scaled = (int16_t)(temp_c * 100.0f); // Ex: 24.37°C -> 2437

                    header_sensor_t header = {0};
                    header.esp_id = (uint8_t)CONFIG_ESP_ID;
                    header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
                    header.type = SENSOR_TYPE_DS18B20; 

                    uint8_t buf[HEADER_SENSOR_SIZE + 2];
                    serialize_header(&header, buf);
                    buf[HEADER_SENSOR_SIZE]     = (uint8_t)((temp_scaled >> 8) & 0xFF);
                    buf[HEADER_SENSOR_SIZE + 1] = (uint8_t)(temp_scaled & 0xFF);

                    log_msg(TAG, "SUCCESS! DS18B20 temp: %.2f°C", temp_c);

                #if CONFIG_USE_UDPLIB
                    send_udp_sensor(buf, sizeof(buf));
                #endif
                #if CONFIG_USE_ESPNOW
                #endif
                } 
                else {
                    log_msg(TAG, "DS18B20 CRC Mismatch! Calc: 0x%02X vs Recv: 0x%02X", 
                            calculated_crc, scratchpad[8]);
                }
            } else {
                log_msg(TAG, "DS18B20 reset failed before read!");
            }
        } 
        else {
            log_msg(TAG, "DS18B20 reset failed before convert!");
        }

        vTaskDelay(pdMS_TO_TICKS(2000)); // Pause entre 2 mesures
    }
    vTaskDelete(NULL);
}


#endif

#if CONFIG_USE_KY020

#define OUT_PIN_KY020 23

static SemaphoreHandle_t sem_ky020 = NULL;

static void IRAM_ATTR ky020_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    xSemaphoreGiveFromISR(sem_ky020, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky020() {

    esp_err_t err;

    if (sem_ky020 != NULL) {
        log_msg(TAG, "KY-040 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky020 = xSemaphoreCreateBinary();
    if (sem_ky020 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(OUT_PIN_KY020);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY020);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY020, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY020);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY020, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY020);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY020);
        return err;
    }

    err = gpio_isr_handler_add(OUT_PIN_KY020, ky020_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY020);
        return err;
    }

    log_msg(TAG, "KY-020 initialized");
    return ESP_OK;
}

static void ky020_task(void * params) {
    esp_err_t err;
    
    err = init_ky020();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky020, portMAX_DELAY) == pdTRUE) {

            bool val = gpio_get_level(OUT_PIN_KY020);

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY020;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = val;
            log_msg(TAG, "send val : %d", val);
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif

        }
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_KY018

// Variables globales pour le driver
static adc_oneshot_unit_handle_t adc1_handle = NULL;
static adc_cali_handle_t adc1_cali_handle = NULL;

#define KY018_ADC_CHANNEL ADC_CHANNEL_0

/**
 * Initialize KY
 */
esp_err_t init_ky018() {

    esp_err_t err;

    // 1. Init unité ADC1
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    err = adc_oneshot_new_unit(&init_config, &adc1_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_new_unit failed: %s", esp_err_to_name(err));
        return err;
    }

    adc_oneshot_chan_cfg_t chan_config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = ADC_ATTEN_DB_0  // 0~3.1V
    };
    err = adc_oneshot_config_channel(adc1_handle, KY018_ADC_CHANNEL, &chan_config);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_config_channel failed: %s", esp_err_to_name(err));
        return err;
    }

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_0,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_curve_fitting(&cali_config, &adc1_cali_handle);
#else
    // 3. Calibration (line fitting, ESP32 classique)
    adc_cali_line_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_0,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_line_fitting(&cali_config, &adc1_cali_handle);
#endif

    if (err != ESP_OK) {
        // Pas bloquant, on continue sans calibration
        log_msg_lvl(ESP_LOG_WARN, TAG, "Calibration non disponible: %s", esp_err_to_name(err));
        adc1_cali_handle = NULL;
    }

    log_msg(TAG, "KY-018 initialized");

    return ESP_OK;
}

/**
 * Periodic KY-018 monitoring task
 */
static void ky018_task(void * params) {

