FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    int raw_val = 0;
    esp_err_t err;

    err = init_ky018();
    if (err != ESP_OK) {
        vTaskDelete(NULL);
        return;
    }

    while (monitoring) {
        esp_err_t err = adc_oneshot_read(adc1_handle, KY018_ADC_CHANNEL, &raw_val);
        if (err == ESP_OK) {

            int32_t val = raw_val;
            //log_msg(TAG, "photoresistor adc raw value: %d", val);
                    
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY018;
            uint8_t buf[HEADER_SENSOR_SIZE + 4];
            serialize_header(&header, buf);
            memcpy(&buf[HEADER_SENSOR_SIZE], &val, 4);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_KY031

#define OUT_PIN_KY031 23

static SemaphoreHandle_t sem_ky031 = NULL;

static void IRAM_ATTR ky031_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    xSemaphoreGiveFromISR(sem_ky031, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky031() {

    esp_err_t err;

    if (sem_ky031 != NULL) {
        log_msg(TAG, "KY-031 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky031 = xSemaphoreCreateBinary();
    if (sem_ky031 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(OUT_PIN_KY031);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY031);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY031, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY031);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY031, GPIO_INTR_POSEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY031);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY031);
        return err;
    }

    err = gpio_isr_handler_add(OUT_PIN_KY031, ky031_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY031);
        return err;
    }

    log_msg(TAG, "KY-031 initialized");
    return ESP_OK;
}

static void ky031_task(void * params) {
    esp_err_t err;
    
    err = init_ky031();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky031, portMAX_DELAY) == pdTRUE) {

            bool val = gpio_get_level(OUT_PIN_KY031);

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY031;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = val;
            log_msg(TAG, "send val : %d", val);
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif

        }
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_KY017

#define OUT_PIN_KY017 23

static SemaphoreHandle_t sem_ky017 = NULL;

static void IRAM_ATTR ky017_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    xSemaphoreGiveFromISR(sem_ky017, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky017() {

    esp_err_t err;

    if (sem_ky017 != NULL) {
        log_msg(TAG, "KY-017 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky017 = xSemaphoreCreateBinary();
    if (sem_ky017 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(OUT_PIN_KY017);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY017);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY017, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY017);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY017, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY017);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY017);
        return err;
    }

    err = gpio_isr_handler_add(OUT_PIN_KY017, ky017_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY017);
        return err;
    }

    log_msg(TAG, "KY-017 initialized");
    return ESP_OK;
}

static void ky017_task(void * params) {
    esp_err_t err;
    
    err = init_ky017();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky017, portMAX_DELAY) == pdTRUE) {

            bool val = gpio_get_level(OUT_PIN_KY017);

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY017;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = val;
            log_msg(TAG, "send val : %d", val);
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif

