FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
        }
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_KY005

#define IR_TX_GPIO_PIN 23

#define NEC_HEADER_SYMBOL    (rmt_symbol_word_t){ .duration0 = 9000, .level0 = 1, .duration1 = 4500, .level1 = 0 }
#define NEC_BIT_ONE_SYMBOL   (rmt_symbol_word_t){ .duration0 = 562,  .level0 = 1, .duration1 = 1688, .level1 = 0 }
#define NEC_BIT_ZERO_SYMBOL  (rmt_symbol_word_t){ .duration0 = 562,  .level0 = 1, .duration1 = 562,  .level1 = 0 }
#define NEC_END_SYMBOL       (rmt_symbol_word_t){ .duration0 = 562,  .level0 = 1, .duration1 = 0,    .level1 = 0 }

static rmt_channel_handle_t tx_ky005_channel = NULL;
static rmt_encoder_handle_t copy_encoder_ky005 = NULL;

static esp_err_t init_ky005() {
    
    esp_err_t err;

    rmt_tx_channel_config_t tx_chan_config = {
        .clk_src = RMT_CLK_SRC_DEFAULT,
        .gpio_num = IR_TX_GPIO_PIN,         // Ton GPIO 23
        .mem_block_symbols = 64,
        .resolution_hz = 1000000,           // 1 MHz
        .trans_queue_depth = 4,             // LE CHAMP MANQUANT CRUCIAL !
        .flags.invert_out = false,
        .flags.with_dma = false,
    };
    err = rmt_new_tx_channel(&tx_chan_config, &tx_ky005_channel);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) creating tx channel rmt", esp_err_to_name(err));
        return err;
    }

    // Modulation 38 kHz indispensable pour le récepteur KY-022
    rmt_carrier_config_t carrier_config = {
        .frequency_hz = 38000,
        .duty_cycle = 0.33, // Allumé 33% du temps pour économiser la LED et maximiser la portée
    };
    err = rmt_apply_carrier(tx_ky005_channel, &carrier_config);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) apply carrier modulation rmt", esp_err_to_name(err));
        return err;
    }
    
    err = rmt_enable(tx_ky005_channel);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) enable rmt", esp_err_to_name(err));
        return err;
    }

    // AJOUT DE L'ENCODEUR DE COPIE NATIF
    rmt_copy_encoder_config_t copy_encoder_config = {};
    err = rmt_new_copy_encoder(&copy_encoder_config, &copy_encoder_ky005);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) creating copy encoder", esp_err_to_name(err));
        return err;
    }
    
    log_msg(TAG, "KY-005 initialized");
    return ESP_OK;
}

static esp_err_t send_ir_frame_raw(uint32_t data) {
    // 1 header + 32 bits de données + 1 bit de fin = 34 symboles RMT
    rmt_symbol_word_t ir_payload[34];
    
    // Étape 1 : On injecte le Header NEC
    ir_payload[0] = NEC_HEADER_SYMBOL;

    // Étape 2 : On convertit les 32 bits de données un par un (MSB first)
    for (int i = 0; i < 32; i++) {
        if ((data >> (31 - i)) & 0x01) {
            ir_payload[i + 1] = NEC_BIT_ONE_SYMBOL;
        } else {
            ir_payload[i + 1] = NEC_BIT_ZERO_SYMBOL;
        }
    }

    // Étape 3 : On ferme la trame
    ir_payload[33] = NEC_END_SYMBOL;

    rmt_transmit_config_t transmit_config = {
        .loop_count = 0, // Envoyer une seule fois
    };

    // On balance la sauce au matériel
    return rmt_transmit(tx_ky005_channel, copy_encoder_ky005, 
        (const void *)ir_payload, sizeof(ir_payload), &transmit_config);
    
}

static void ky005_task(void * params) {
    esp_err_t err;

    err = init_ky005();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    uint32_t count = 0;

    while (monitoring) {

        err = send_ir_frame_raw(count);
        
        if (err == ESP_OK) {
            log_msg(TAG, "Sending IR count : %u", count);
            count++;
        } else {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) sending IR frame", esp_err_to_name(err));
        }

        // Délai de 1 seconde (1000 ms) avant le prochain envoi
        vTaskDelay(pdMS_TO_TICKS(1000));

    }
    vTaskDelete(NULL);

}

#endif

#if CONFIG_USE_KY022

#define IR_RX_GPIO_PIN 22

static rmt_channel_handle_t rx_ky022_channel = NULL;
static SemaphoreHandle_t ky022_rx_sem = NULL;
static rmt_symbol_word_t ky022_rx_buffer[64];

// Le callback de l'interruption (ISR) quand le RMT a fini de capter la trame
static bool ky022_rmt_rx_done_callback(rmt_channel_handle_t rx_chan, const rmt_rx_done_event_data_t *edata, void *user_data) {
    BaseType_t high_task_wakeup = pdFALSE;
    // On libère la tâche qui attend sagement
    xSemaphoreGiveFromISR(ky022_rx_sem, &high_task_wakeup);
    return high_task_wakeup == pdTRUE;
}


static esp_err_t init_ky022() {
    esp_err_t err;

    // 1. Création du sémaphore
    ky022_rx_sem = xSemaphoreCreateBinary();
    if (ky022_rx_sem == NULL) {
        return ESP_ERR_NO_MEM;
    }

    rmt_rx_channel_config_t rx_chan_config = {
        .clk_src = RMT_CLK_SRC_DEFAULT,
        .resolution_hz = 1000000, // 1 tick = 1 microseconde
        .mem_block_symbols = 64,  // Assez grand pour stocker nos 34 symboles
        .gpio_num = IR_RX_GPIO_PIN,
        .flags.with_dma = false,
    };
    
    err = rmt_new_rx_channel(&rx_chan_config, &rx_ky022_channel);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) creating rx channel rmt", esp_err_to_name(err));
        return err;
    }

    rmt_rx_event_callbacks_t cbs = {
        .on_recv_done = ky022_rmt_rx_done_callback,
    };

    err = rmt_rx_register_event_callbacks(rx_ky022_channel, &cbs, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) register rx callback rmt", esp_err_to_name(err));
        return err;
    }
    
    // On active le canal RX
    err = rmt_enable(rx_ky022_channel);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) enable rx channel rmt", esp_err_to_name(err));
        return err;
    }

    log_msg(TAG, "KY-022 initialized");
    return ESP_OK;
}

static void ky022_task(void *params) {
    esp_err_t err;
    
    if (init_ky022() != ESP_OK) {
        vTaskDelete(NULL);
        return;
    }

    rmt_receive_config_t receive_config = {
        .signal_range_min_ns = 1000,      // Optionnel : ignore les impulsions < 1µs (bruit)
        .signal_range_max_ns = 20000000,  // Si rien ne se passe pendant 20ms, on valide la fin de la trame
    };

