FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    while (monitoring) {

        memset(ky022_rx_buffer, 0, sizeof(ky022_rx_buffer));
        
        // Cette fonction bloque la tâche jusqu'à ce qu'une trame IR arrive
        rmt_receive(rx_ky022_channel, ky022_rx_buffer, sizeof(ky022_rx_buffer), &receive_config);

        if (xSemaphoreTake(ky022_rx_sem, portMAX_DELAY) == pdTRUE) {
            
            // On compte combien de symboles le RMT a écrit dans le buffer
            size_t symbols_count = 0;
            for (size_t i = 0; i < 64; i++) {
                if (ky022_rx_buffer[i].duration0 == 0 && ky022_rx_buffer[i].duration1 == 0) {
                    symbols_count = i;
                    break;
                }
            }

            // Une trame NEC complète = 34 symboles
            if (symbols_count >= 34) {
                uint32_t ir_data = 0;

                // Décodage des 32 bits (on saute l'index 0 qui est le Header)
                for (int i = 0; i < 32; i++) {
                    // Dans le protocole NEC, duration1 (le silence) fait 562µs pour un '0' et 1688µs pour un '1'
                    if (ky022_rx_buffer[i + 1].duration1 > 1100) {
                        ir_data |= (1 << (31 - i)); // Bit à 1
                    }
                }

                log_msg(TAG, "IR frame received : 0x%08X", ir_data);
            } else {
                log_msg_lvl(ESP_LOG_WARN, TAG, "Signal received, invalid frame (symbols: %d)", symbols_count);
            }
        }
        
        // Petit repos optionnel de 100ms entre deux décodages pour ne pas spammer si le bouton reste appuyé
        vTaskDelay(pdMS_TO_TICKS(100));
        
    }
    vTaskDelete(NULL);
}

#endif


#if CONFIG_USE_KY021

#define OUT_PIN_KY021 23

static SemaphoreHandle_t sem_ky021 = NULL;

static void IRAM_ATTR ky021_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    xSemaphoreGiveFromISR(sem_ky021, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky021() {

    esp_err_t err;

    if (sem_ky021 != NULL) {
        log_msg(TAG, "KY-021 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky021 = xSemaphoreCreateBinary();
    if (sem_ky021 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(OUT_PIN_KY021);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY021);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY021, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY021);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY021, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY021);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY021);
        return err;
    }

    err = gpio_isr_handler_add(OUT_PIN_KY021, ky021_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY021);
        return err;
    }

    log_msg(TAG, "KY-021 initialized");
    return ESP_OK;
}

static void ky021_task(void * params) {
    esp_err_t err;
    
    err = init_ky021();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky021, portMAX_DELAY) == pdTRUE) {

            bool val = gpio_get_level(OUT_PIN_KY021);

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY021;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = val;
            log_msg(TAG, "send val : %d", val);
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif

        }
    }
    vTaskDelete(NULL);
}

#endif

#if CONFIG_USE_KY004

#define OUT_PIN_KY004 23

static SemaphoreHandle_t sem_ky004 = NULL;

static void IRAM_ATTR ky004_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    xSemaphoreGiveFromISR(sem_ky004, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky004() {

    esp_err_t err;

    if (sem_ky004 != NULL) {
        log_msg(TAG, "KY-004 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky004 = xSemaphoreCreateBinary();
    if (sem_ky004 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(OUT_PIN_KY004);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY004);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY004, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY004);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY004, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY004);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY004);
        return err;
    }

    err = gpio_isr_handler_add(OUT_PIN_KY004, ky004_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY004);
        return err;
    }

    log_msg(TAG, "KY-004 initialized");
    return ESP_OK;
}

static void ky004_task(void * params) {
    esp_err_t err;
    
    err = init_ky004();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky004, portMAX_DELAY) == pdTRUE) {

            bool val = gpio_get_level(OUT_PIN_KY004);

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY004;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = val;
            log_msg(TAG, "send val : %d", val);
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif

