FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
        }
    }
    vTaskDelete(NULL);
}
#endif


#if CONFIG_USE_KY039

// Variables globales pour le driver
static adc_oneshot_unit_handle_t adc1_handle = NULL;
static adc_cali_handle_t adc1_cali_handle = NULL;

#define KY039_ADC_CHANNEL ADC_CHANNEL_4 //gpio32

/**
 * Initialize KY
 */
esp_err_t init_ky039() {

    esp_err_t err;

    // 1. Init unité ADC1
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    err = adc_oneshot_new_unit(&init_config, &adc1_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_new_unit failed: %s", esp_err_to_name(err));
        return err;
    }

    adc_oneshot_chan_cfg_t chan_config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = ADC_ATTEN_DB_12  // 0~3.1V
    };
    err = adc_oneshot_config_channel(adc1_handle, KY039_ADC_CHANNEL, &chan_config);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_config_channel failed: %s", esp_err_to_name(err));
        return err;
    }

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_curve_fitting(&cali_config, &adc1_cali_handle);
#else
    // 3. Calibration (line fitting, ESP32 classique)
    adc_cali_line_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_line_fitting(&cali_config, &adc1_cali_handle);
#endif

    if (err != ESP_OK) {
        // Pas bloquant, on continue sans calibration
        log_msg_lvl(ESP_LOG_WARN, TAG, "Calibration non disponible: %s", esp_err_to_name(err));
        adc1_cali_handle = NULL;
    }

    log_msg(TAG, "KY-039 initialized");

    return ESP_OK;
}

/**
 * Periodic KY-039 monitoring task
 */
static void ky039_task(void * params) {

    int raw_val = 0;
    esp_err_t err;

    err = init_ky039();
    if (err != ESP_OK) {
        vTaskDelete(NULL);
        return;
    }

    while (monitoring) {
        esp_err_t err = adc_oneshot_read(adc1_handle, KY039_ADC_CHANNEL, &raw_val);
        if (err == ESP_OK) {

            int32_t val = raw_val;
            log_msg(TAG, "raw value: %d", val);
                    
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY039;
            uint8_t buf[HEADER_SENSOR_SIZE + 4];
            serialize_header(&header, buf);
            memcpy(&buf[HEADER_SENSOR_SIZE], &val, 4);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    vTaskDelete(NULL);
}

#endif


#if CONFIG_USE_KY032

#define OUT_PIN_KY032 23

static SemaphoreHandle_t sem_ky032 = NULL;

static void IRAM_ATTR ky032_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;

    xSemaphoreGiveFromISR(sem_ky032, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky032() {

    esp_err_t err;

    if (sem_ky032 != NULL) {
        log_msg(TAG, "KY-031 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky032 = xSemaphoreCreateBinary();
    if (sem_ky032 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }

    err = gpio_reset_pin(OUT_PIN_KY032);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), OUT_PIN_KY032);
        return err;
    }

    err = gpio_set_direction(OUT_PIN_KY032, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), OUT_PIN_KY032);
        return err;
    }

    err = gpio_set_intr_type(OUT_PIN_KY032, GPIO_INTR_POSEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), OUT_PIN_KY032);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), OUT_PIN_KY032);
        return err;
    }

    err = gpio_isr_handler_add(OUT_PIN_KY032, ky032_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), OUT_PIN_KY032);
        return err;
    }

    log_msg(TAG, "KY-031 initialized");
    return ESP_OK;
}

static void ky032_task(void * params) {
    esp_err_t err;
    
    err = init_ky032();
    if (err != ESP_OK){
        vTaskDelete(NULL);
        return;
    }

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky032, portMAX_DELAY) == pdTRUE) {

            bool val = gpio_get_level(OUT_PIN_KY032);

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY032;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = val;
            log_msg(TAG, "send val : %d", val);
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif

        }
    }
    vTaskDelete(NULL);
}

#endif


#if CONFIG_USE_KY023

#define SW_PIN_KY023 22
#define KY023_ADC_CHANNEL_X ADC_CHANNEL_4 //gpio32
#define KY023_ADC_CHANNEL_Y ADC_CHANNEL_5 //gpio33

// On demande 2000 Hz au total. Comme on a 2 canaux (X et Y), 
// chaque canal sera échantillonné à 1000 Hz (pile 1 ms !)
#define SAMPLE_FREQ_HZ     40000  // 40 kHz : compatible avec absolument tous les modèles d'ESP32
#define READ_LEN           1024   // Taille du buffer DMA (32 mesures de 2 octets)

// Variables globales pour le driver
static adc_continuous_handle_t adc_handle = NULL;

