FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
static SemaphoreHandle_t sem_ky023 = NULL;

static void IRAM_ATTR ky023_sw_isr_handler(void* arg)
{
    BaseType_t taskAwoken = pdFALSE;
    
    xSemaphoreGiveFromISR(sem_ky023, &taskAwoken);
    portYIELD_FROM_ISR(taskAwoken); //wake up the task waiting for semaphore
}

static esp_err_t init_ky023() {

    esp_err_t err;

    if (sem_ky023 != NULL) {
        log_msg(TAG, "KY-023 already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    sem_ky023 = xSemaphoreCreateBinary();
    if (sem_ky023 == NULL) {
        log_msg(TAG, "Error creating semaphore");
        return ESP_ERR_NOT_ALLOWED;
    }
    
    err = gpio_reset_pin(SW_PIN_KY023);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), SW_PIN_KY023);
        return err;
    }

    err = gpio_set_direction(SW_PIN_KY023, GPIO_MODE_INPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), SW_PIN_KY023);
        return err;
    }

    err = gpio_set_intr_type(SW_PIN_KY023, GPIO_INTR_ANYEDGE);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting interrupt type pin %d", esp_err_to_name(err), SW_PIN_KY023);
        return err;
    }

    err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        log_msg(TAG, "Error (%s) installing isr pin %d", esp_err_to_name(err), SW_PIN_KY023);
        return err;
    }

    err = gpio_isr_handler_add(SW_PIN_KY023, ky023_sw_isr_handler, NULL);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) adding isr handler pin %d", esp_err_to_name(err), SW_PIN_KY023);
        return err;
    }

   // --- CONFIGURATION DE L'ADC CONTINU (DMA) ---
    adc_continuous_handle_cfg_t adc_config = {
        .max_store_buf_size = 4096,
        .conv_frame_size = READ_LEN,
    };
    err = adc_continuous_new_handle(&adc_config, &adc_handle);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) while creating ADC continuous unit", esp_err_to_name(err));
        return err;
    }

    // On définit le paterne de scan : Canal X puis Canal Y
    adc_digi_pattern_config_t adc_pattern[2] = {
        {
            .atten = ADC_ATTEN_DB_12,
            .channel = KY023_ADC_CHANNEL_X,
            .unit = ADC_UNIT_1,
            .bit_width = ADC_BITWIDTH_12,
        },
        {
            .atten = ADC_ATTEN_DB_12,
            .channel = KY023_ADC_CHANNEL_Y,
            .unit = ADC_UNIT_1,
            .bit_width = ADC_BITWIDTH_12,
        }
    };

    adc_continuous_config_t dig_cfg = {
        .pattern_num = 2,
        .adc_pattern = adc_pattern,
        .sample_freq_hz = SAMPLE_FREQ_HZ,
        .conv_mode = ADC_CONV_SINGLE_UNIT_1,
        .format = ADC_DIGI_OUTPUT_FORMAT_TYPE1,
    };

    err = adc_continuous_config(adc_handle, &dig_cfg);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) while applying adc config", esp_err_to_name(err));
        return err;
    }

    err = adc_continuous_start(adc_handle);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) starting continuous adc ", esp_err_to_name(err));
        return err;
    }

    log_msg(TAG, "KY-023 initialized");
    return ESP_OK;
}

static void ky023_task_sw(void * params) {
    esp_err_t err;
    
    uint8_t val;

    while (monitoring)
    {
        if (xSemaphoreTake(sem_ky023, portMAX_DELAY) == pdTRUE) {

            val = gpio_get_level(SW_PIN_KY023);

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY023_SW;
            uint8_t buf[HEADER_SENSOR_SIZE + 1];
            serialize_header(&header, buf);
            buf[HEADER_SENSOR_SIZE] = val;
            log_msg(TAG, "sw val: %d", val);
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }
    }
    vTaskDelete(NULL);
}


static void ky023_task_xy(void * params) {
    esp_err_t err;

    uint8_t result[READ_LEN] = {0};
    uint32_t ret_num = 0;
    
    int raw_val_x;
    int raw_val_y;

    while (monitoring)
    {
        err = adc_continuous_read(adc_handle, result, READ_LEN, &ret_num, pdMS_TO_TICKS(10));
        
        if (err == ESP_OK) {
            // Le DMA nous donne un paquet de mesures, on l'analyse
            for (int i = 0; i < ret_num; i += SOC_ADC_DIGI_RESULT_BYTES) {
                adc_digi_output_data_t *p = (adc_digi_output_data_t *)&result[i];
                
                // On regarde de quel canal vient la mesure actuelle
                if (p->type1.channel == KY023_ADC_CHANNEL_X) {
                    raw_val_x = p->type1.data;
                } else if (p->type1.channel == KY023_ADC_CHANNEL_Y) {
                    raw_val_y = p->type1.data;
                }
            }

            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = SENSOR_TYPE_KY023_XY;
            uint8_t buf[HEADER_SENSOR_SIZE + 8];
            serialize_header(&header, buf);
            memcpy(&buf[HEADER_SENSOR_SIZE], &raw_val_x, 4);
            memcpy(&buf[HEADER_SENSOR_SIZE + 4], &raw_val_y, 4);

            //log_msg(TAG, "x: %d, y: %d", raw_val_x, raw_val_y);

        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    vTaskDelete(NULL);
}

#endif


#if CONFIG_USE_ESP

#if CONFIG_USE_WIFI
#include "wifi_lib.h"
#endif
#include "esp_system.h"

#if CONFIG_USE_UDPLIB
#include "udp_lib.h"
#endif

#include "driver/temperature_sensor.h"
#include "esp_heap_caps.h"

#if CONFIG_FREE_RTOS_TASK_DEBUG

#define MAX_TRACKED_TASKS 32

// Structure pour mémoriser l'état d'une tâche au tour précédent
typedef struct {
    UBaseType_t task_number;
    uint32_t last_runtime;
    bool active;
    bool visited; // Pour nettoyer les tâches qui ont été supprimées
} TaskHistory_t;

static void get_detailed_cpu_usage(void) {
    static TaskHistory_t history[MAX_TRACKED_TASKS] = {0};
    
