FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
    UBaseType_t uxArraySize = uxTaskGetNumberOfTasks();
    TaskStatus_t *pxTaskStatusArray = malloc(uxArraySize * sizeof(TaskStatus_t));
    
    if (pxTaskStatusArray == NULL) return;

    uint32_t ulTotalRunTime;
    uxArraySize = uxTaskGetSystemState(pxTaskStatusArray, uxArraySize, &ulTotalRunTime);
    
    // 1. Calculer le delta du temps global du système
    static uint32_t ulLastTotalRunTime = 0;
    uint32_t ulDeltaTotalTime = ulTotalRunTime - ulLastTotalRunTime;
    ulLastTotalRunTime = ulTotalRunTime;

    // Prépare l'historique pour le marquage
    for (int i = 0; i < MAX_TRACKED_TASKS; i++) {
        history[i].visited = false;
    }

    if (ulDeltaTotalTime > 0) {
        // 2. Parcourir toutes les tâches actives actuelles
        for (UBaseType_t x = 0; x < uxArraySize; x++) {
            UBaseType_t task_num = pxTaskStatusArray[x].xTaskNumber;
            uint32_t current_runtime = pxTaskStatusArray[x].ulRunTimeCounter;
            uint32_t delta_task_time = 0;
            int history_idx = -1;

            // Chercher la tâche dans notre historique
            for (int i = 0; i < MAX_TRACKED_TASKS; i++) {
                if (history[i].active && history[i].task_number == task_num) {
                    history_idx = i;
                    break;
                }
            }

            if (history_idx != -1) {
                // Tâche déjà connue : on calcule le delta
                delta_task_time = current_runtime - history[history_idx].last_runtime;
                history[history_idx].last_runtime = current_runtime;
                history[history_idx].visited = true;
            } else {
                // Nouvelle tâche : on lui trouve une place libre dans l'historique
                for (int i = 0; i < MAX_TRACKED_TASKS; i++) {
                    if (!history[i].active) {
                        history[i].task_number = task_num;
                        history[i].last_runtime = current_runtime;
                        history[i].active = true;
                        history[i].visited = true;
                        break;
                    }
                }
                // Premier tour pour cette tâche, pas encore de delta valide
                delta_task_time = 0; 
            }

            // 3. Calculer le POURCENTAGE CPU réel de la tâche
            // Sur ESP32 (Dual Core), ulDeltaTotalTime correspond au temps d'un cœur.
            // Une tâche ne pouvant tourner que sur un seul cœur à la fois, son max est de 100%.
            float task_cpu_percent = ((float)delta_task_time / (float)ulDeltaTotalTime) * 100.0f;
            if (task_cpu_percent > 100.0f) task_cpu_percent = 100.0f; // Sécurité anti-jitter

            // --- TU AS TES DONNÉES ICI ---
            const char* name = pxTaskStatusArray[x].pcTaskName;
            uint32_t stack = pxTaskStatusArray[x].usStackHighWaterMark;
            
            // Log de débug direct sur le port série (pas de ESP_LOG pour éviter la récursion !)
            log_msg(TAG, "Task: %-12s | CPU: %5.1f%% | Min Stack: %lu bytes", 
                   name, task_cpu_percent, (unsigned long)stack);
        }
    }

    // 4. Nettoyage : si une tâche a disparu de FreeRTOS, on libère son slot dans l'historique
    for (int i = 0; i < MAX_TRACKED_TASKS; i++) {
        if (history[i].active && !history[i].visited) {
            history[i].active = false;
        }
    }

    free(pxTaskStatusArray);
}
#endif

static void get_global_cpu_usage(float *out_core0, float *out_core1) {
    UBaseType_t uxArraySize = uxTaskGetNumberOfTasks();
    TaskStatus_t *pxTaskStatusArray = malloc(uxArraySize * sizeof(TaskStatus_t));
    
    if (pxTaskStatusArray != NULL) {
        uint32_t ulTotalRunTime;
        uxArraySize = uxTaskGetSystemState(pxTaskStatusArray, uxArraySize, &ulTotalRunTime);
        
        static uint32_t last_total = 0, last_idle0 = 0, last_idle1 = 0;
        uint32_t current_idle0 = 0, current_idle1 = 0;

        // Trouver les tâches IDLE
        for (UBaseType_t x = 0; x < uxArraySize; x++) {
            if (strcmp(pxTaskStatusArray[x].pcTaskName, "IDLE0") == 0) {
                current_idle0 = pxTaskStatusArray[x].ulRunTimeCounter;
            } else if (strcmp(pxTaskStatusArray[x].pcTaskName, "IDLE1") == 0) {
                current_idle1 = pxTaskStatusArray[x].ulRunTimeCounter;
            }
        }

        uint32_t delta_total = ulTotalRunTime - last_total;
        if (delta_total > 0) {
            uint32_t delta_idle0 = current_idle0 - last_idle0;
            uint32_t delta_idle1 = current_idle1 - last_idle1;

            // Calcul du pourcentage d'utilisation
            *out_core0 = 100.0f * (1.0f - ((float)delta_idle0 / (float)delta_total));
            *out_core1 = 100.0f * (1.0f - ((float)delta_idle1 / (float)delta_total));
        }

        last_total = ulTotalRunTime;
        last_idle0 = current_idle0;
        last_idle1 = current_idle1;

        free(pxTaskStatusArray);
    }
}

#define ESP_PACKET_SIZE (5 * sizeof(uint32_t) + 1 * sizeof(int8_t) + 3 * sizeof(float) + 3 * sizeof(uint8_t) + sizeof(int16_t))

typedef struct esp_packet_st {
    float esp_deg;
    int8_t rssi;
    uint8_t reset_reason;
    uint32_t free_dram;
    uint32_t free_dram_block;
    uint32_t free_psram;
    uint32_t free_psram_block;
    uint8_t angle;
    int16_t motor;
    uint32_t nb_packets;
    float core0;
    float core1;
    uint8_t drive_mode;
} esp_packet_t;

static void serialize_esp_packet(esp_packet_t *pkt, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE; 
    memcpy(&buf[len], &pkt->esp_deg, sizeof(float));
    len += sizeof(float);
    memcpy(&buf[len], &pkt->rssi, sizeof(int8_t));
    len += sizeof(int8_t);
    memcpy(&buf[len], &pkt->reset_reason, sizeof(uint8_t));
    len += sizeof(uint8_t);
    memcpy(&buf[len], &pkt->free_dram, sizeof(uint32_t));
    len += sizeof(uint32_t);
    memcpy(&buf[len], &pkt->free_dram_block, sizeof(uint32_t));
    len += sizeof(uint32_t);
    memcpy(&buf[len], &pkt->free_psram, sizeof(uint32_t));
    len += sizeof(uint32_t);
    memcpy(&buf[len], &pkt->free_psram_block, sizeof(uint32_t));
    len += sizeof(uint32_t);
    memcpy(&buf[len], &pkt->angle, sizeof(uint8_t));
    len += sizeof(uint8_t);
    memcpy(&buf[len], &pkt->motor, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len], &pkt->nb_packets, sizeof(uint32_t));
    len += sizeof(uint32_t);
    memcpy(&buf[len], &pkt->core0, sizeof(float));
    len += sizeof(float);
    memcpy(&buf[len], &pkt->core1, sizeof(float));
    len += sizeof(float);
    memcpy(&buf[len], &pkt->drive_mode, sizeof(uint8_t));
}

