FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
static void print_esp(esp_packet_t *pkt) {
    log_msg(TAG, "ESP Temp: %.3f°C", pkt->esp_deg);
    log_msg(TAG, "STA RSSI: %d dBm", pkt->rssi);
    log_msg(TAG, "Last reset reason: %u", pkt->reset_reason);
    
    // DRAM : Affichage brut + conversion en Ko
    log_msg(TAG, "Free DRAM: %lu bytes (%.2f KB)", (unsigned long)pkt->free_dram, pkt->free_dram / 1024.0f);
    log_msg(TAG, "Max DRAM block: %lu bytes (%.2f KB)", (unsigned long)pkt->free_dram_block, pkt->free_dram_block / 1024.0f);
    
    // PSRAM : Affichage brut + conversion en Mo (vu qu'on a 8 Mo sur le S3)
    log_msg(TAG, "Free PSRAM: %lu bytes (%.2f MB)", (unsigned long)pkt->free_psram, pkt->free_psram / (1024.0f * 1024.0f));
    log_msg(TAG, "Max PSRAM block: %lu bytes (%.2f MB)", (unsigned long)pkt->free_psram_block, pkt->free_psram_block / (1024.0f * 1024.0f));
    
    log_msg(TAG, "Angle: %u°", pkt->angle);
    log_msg(TAG, "Motor: %d", pkt->motor);
    log_msg(TAG, "Drive mode: %d", pkt->drive_mode);
    log_msg(TAG, "Packets received: %lu", (unsigned long)pkt->nb_packets);
    log_msg(TAG, "CPU Usage: Core0: %.3f%%, Core1: %.3f%%", pkt->core0, pkt->core1);
}

static void esp_monitor_task(void *params) {
    esp_err_t err;

    float tsens_out;
    temperature_sensor_config_t temp_sensor = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
    temperature_sensor_handle_t temp_handle = NULL;
    err = temperature_sensor_install(&temp_sensor, &temp_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) installing ESP temperature sensor", esp_err_to_name(err));
        vTaskDelete(NULL);
        return;
    }
    err = temperature_sensor_enable(temp_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) enabling ESP temperature sensor", esp_err_to_name(err));
        vTaskDelete(NULL);
        return;
    }

    while (monitoring) {

        esp_packet_t esp_pck = {0};
        
        err = temperature_sensor_get_celsius(temp_handle, &tsens_out);
        if (err != ESP_OK) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) reading ESP temperature sensor", esp_err_to_name(err));
        } else {
            esp_pck.esp_deg = tsens_out;
        }

        #if CONFIG_USE_WIFI
        int rssi = 0;
        err = sta_get_rssi(&rssi);
        if (err != ESP_OK) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) reading STA RSSI", esp_err_to_name(err));
        } else {
            esp_pck.rssi = (int8_t)rssi;
        }
        #endif

        //DRAM + PSRAM on ESP32S3, we can seperate
        //log_msg(TAG, "min free heap size: %u", esp_get_minimum_free_heap_size());
        //log_msg(TAG, "free heap size: %u", esp_get_free_heap_size());

        esp_pck.reset_reason = (uint8_t)esp_reset_reason();

        
        esp_pck.free_dram = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        esp_pck.free_dram_block = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);

        esp_pck.free_psram = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
        esp_pck.free_psram_block = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);

        //uint32_t free_iram = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_IRAM_8BIT);
        //log_msg(TAG, "free iram: %u", free_iram);

        #if CONFIG_USE_LEDLIB
        uint8_t angle = 0;
        int16_t motor = 0;
        err = get_servo_angle(&angle);
        if (err != ESP_OK) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) reading ANGLE", esp_err_to_name(err));
        } else {
            esp_pck.angle = angle;
        }
        err = get_motor_percent(&motor);
        if (err != ESP_OK) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) reading MOTOR", esp_err_to_name(err));
        } else {
            esp_pck.motor = motor;
        }
        esp_pck.drive_mode = (uint8_t)get_drive_mode();
        #endif

        #if CONFIG_USE_UDPLIB
        esp_pck.nb_packets = get_command_packet_received();
        #endif

        float core0 = 0.0, core1 = 0.0;
        get_global_cpu_usage(&core0, &core1);
        esp_pck.core0 = core0;
        esp_pck.core1 = core1;

        //print_esp(&esp_pck);

        #if CONFIG_FREE_RTOS_TASK_DEBUG
        get_detailed_cpu_usage();
        #endif

        header_sensor_t header = {0};
        header.esp_id = (uint8_t)CONFIG_ESP_ID;
        header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
        header.type = SENSOR_TYPE_ESP;
        uint8_t buf[HEADER_SENSOR_SIZE + ESP_PACKET_SIZE];
        serialize_header(&header, buf);
        serialize_esp_packet(&esp_pck, buf);
        
    #if CONFIG_USE_UDPLIB
        send_udp_sensor(buf, sizeof(buf));
    #endif
        
        vTaskDelay(pdMS_TO_TICKS(500));
        
    }
    vTaskDelete(NULL);
}

#endif


esp_err_t init_sensors() {

    esp_err_t err;
    BaseType_t res;

    if (monitoring) {
        log_msg_lvl(ESP_LOG_WARN, TAG, "Sensors already initialized");
        return ESP_FAIL;
    }
    monitoring = true;

#if CONFIG_USE_HCSR04
    
    err = init_hcsr();
    if (err == ESP_OK){
        for (int i = 0; i < sizeof(hc_cfgs) / sizeof(hc_cfg_t); i++) {
            char name[20];
            snprintf(name, sizeof(name), "hc_monitoring_%d", hc_cfgs[i].hc_id);
            res = xTaskCreate(hc_task, name, 4096, &hc_cfgs[i], 5, NULL);
            if (res != pdPASS) {
                log_msg_lvl(ESP_LOG_ERROR, TAG, 
                    "Error (%d) creating HC_%d monitoring task", hc_cfgs[i].hc_id, res);
                return ESP_FAIL;
            }
            vTaskDelay(pdMS_TO_TICKS(25));
        }
    }

#endif

#if CONFIG_USE_INA226
    ina_info_t ina = {0}, ina_temp;
    res = xTaskCreate(ina_task, "ina_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating INA monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_BMP280
    res = xTaskCreate(bmp_task, "bmp_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating bmp monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_MPU9250
    res = xTaskCreate(mpu_task, "mpu_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating mpu monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_KY035
    err = init_ky();
    if (err != ESP_OK){
        return ESP_FAIL;
    }
    ky_info_t ky = {0}, ky_temp;
    res = xTaskCreate(ky_task, "ky_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_RFID_RC522

    res = xTaskCreate(rfid_rc522_task, "rfid_rc522_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating rfid_rc522 monitoring task", res);
        return ESP_FAIL;
    }

#endif

