FireVirtuozz/ESP32/esp_project/components/sensors_lib/sensors_lib.c
#if CONFIG_USE_RCWL_0515

    res = xTaskCreate(rcwl_task, "rcwl_0515_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating rcwl_0515 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_VL53L1X

    res = xTaskCreate(vl_task, "vl53l1x_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating vl53l1x monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_AS5600

    res = xTaskCreate(as_task, "as5600_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating as5600 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY003

    res = xTaskCreate(ky_003_task, "ky_003_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-003 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_FC33

    res = xTaskCreate(fc_33_task, "fc_33_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating FC-33 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY033

    res = xTaskCreate(ky033_task, "ky_033_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-033 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY002

    res = xTaskCreate(ky002_task, "ky_002_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-002 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY040

    res = xTaskCreate(ky040_task, "ky_040_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-040 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_DHT11

    res = xTaskCreate(dht11_task, "dht11_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating DHT11 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_DS18B20

    res = xTaskCreate(ds18b20_task, "ds18b20_monitoring", 4096, (void *)bus_handle, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating ds18b20 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY020

    res = xTaskCreate(ky020_task, "ky020_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-020 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY018

    res = xTaskCreate(ky018_task, "ky018_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-018 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY031

    res = xTaskCreate(ky031_task, "ky031_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-031 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY017

    res = xTaskCreate(ky017_task, "ky017_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-017 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY005

    res = xTaskCreate(ky005_task, "ky005_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-005 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY022

    res = xTaskCreate(ky022_task, "ky022_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-022 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY021

    res = xTaskCreate(ky021_task, "ky_021_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-021 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY004

    res = xTaskCreate(ky004_task, "ky_004_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-004 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY039

    res = xTaskCreate(ky039_task, "ky_039_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-039 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY032

    res = xTaskCreate(ky032_task, "ky_032_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-032 monitoring task", res);
        return ESP_FAIL;
    }

#endif

#if CONFIG_USE_KY023

    err = init_ky023();
    if (err != ESP_OK){
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) during ky023 init", esp_err_to_name(err));
    } else {
        res = xTaskCreate(ky023_task_sw, "ky_023_sw_monitoring", 4096, NULL, 5, NULL);
        if (res != pdPASS) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-023 monitoring task sw", res);
            return ESP_FAIL;
        }
        res = xTaskCreate(ky023_task_xy, "ky_023_xy_monitoring", 4096, NULL, 5, NULL);
        if (res != pdPASS) {
            log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY-023 monitoring task xy", res);
            return ESP_FAIL;
        }
    }


#endif

#if CONFIG_USE_ESP
    res = xTaskCreate(esp_monitor_task, "esp_monitoring", 4096, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating ESP monitoring task", res);
        return ESP_FAIL;
    }
#endif
    
    return ESP_OK;
}